["{\"_id\":1,\"title\":\"Almost All Destiny 2 Heavy Grenade Launchers Disabled Because They're Way Too Good\",\"text\":[{\"isTitle\":false,\"pos\":0,\"text\":\"Update: Well, it's clear Bungie has taken notice of Destiny 2's overpowered heavy grenade launchers. It's taken the drastic step of disabling all non-sunset heavy grenade launchers, with a few exceptions. Uncommon rarity ones can still be used, as can two Exotics: Salvation's Grip and Parasite, the latter of which was exempt from the intended buff in this week's patch.\"},{\"isTitle\":false,\"pos\":1,\"text\":\"There's no word on when these guns will be reactivated, but any chance of them being used to skate through the King's Fall raid this weekend (or any other difficult activity) has now been eliminated.\"},{\"isTitle\":false,\"pos\":4,\"text\":\"Original story: It looks like Bungie may have accidentally buffed Destiny 2's heavy grenade launchers more than it originally intended to, as players discover they now do massive amounts of damage to enemies.\"},{\"isTitle\":false,\"pos\":5,\"text\":\"As reported by Destiny 2 YouTuber Fallout Plays, it's been discovered that although heavy grenade launchers were supposed to get a 10% buff in PvE against majors and above, their damage output has instead been increased 2.5 times the original amount. This means all heavy grenade launchers, including Anarchy, have a 150% buff making them incredibly overpowered.\"},{\"isTitle\":false,\"pos\":6,\"text\":\"One player named SkyWarrior provided Fallout Plays with a damage chart prior to the patch showing that the average DPS for the heavy grenade launcher was around 18,198 in Season of the Haunted. Now, in Season of Plunder, the chart shows that it has skyrocketed to over 41,345.\"},{\"isTitle\":false,\"pos\":7,\"text\":\"Fallout Plays demonstrated the power of the weapon on the boss Shayotet Partisan, showing that it only takes three to four shots to kill him. The only grenade launcher that hasn't been changed is Parasite--as Bungie explained in the patch notes that it already does enough damage on its own.\"},{\"isTitle\":false,\"pos\":8,\"text\":\"However, the biggest noticeable change is to Anarchy, which outputs around 33,500 damage per tick with two single shots, and a grand total of 321,456 damage. The damage only stopped rising due to the fact that Partisan died before the game could register anymore. At high-energy fire, the DPS dramatically also increases to 40,300 damage per tick.\"},{\"isTitle\":false,\"pos\":9,\"text\":\"It's unclear at this time if Bungie is aware of the issue, but players are hoping a hotfix will be implemented before the day one raid race begins on Friday.\"},{\"isTitle\":false,\"pos\":10,\"text\":\"If you're looking for some season 18 guidance, here's how to get map fragments, treasure coordinates, and maps in Season of Plunder, as well as a helpful Ketchcrash guide on how to complete the season's activity.\"},{\"isTitle\":false,\"pos\":11,\"text\":\"Yesterday, the Bungie unveiled Destiny 2: Lightfall, the latest expansion that is set to arrive on February 28, 2023.\"}],\"full_text\":\"almost all destiny 2 heavy grenade launchers disabled because they're way too good.  update: well, it's clear bungie has taken notice of destiny 2's overpowered heavy grenade launchers. it's taken the drastic step of disabling all non-sunset heavy grenade launchers, with a few exceptions. uncommon rarity ones can still be used, as can two exotics: salvation's grip and parasite, the latter of which was exempt from the intended buff in this week's patch. there's no word on when these guns will be reactivated, but any chance of them being used to skate through the king's fall raid this weekend (or any other difficult activity) has now been eliminated. original story: it looks like bungie may have accidentally buffed destiny 2's heavy grenade launchers more than it originally intended to, as players discover they now do massive amounts of damage to enemies. as reported by destiny 2 youtuber fallout plays, it's been discovered that although heavy grenade launchers were supposed to get a 10% buff in pve against majors and above, their damage output has instead been increased 2.5 times the original amount. this means all heavy grenade launchers, including anarchy, have a 150% buff making them incredibly overpowered. one player named skywarrior provided fallout plays with a damage chart prior to the patch showing that the average dps for the heavy grenade launcher was around 18,198 in season of the haunted. now, in season of plunder, the chart shows that it has skyrocketed to over 41,345. fallout plays demonstrated the power of the weapon on the boss shayotet partisan, showing that it only takes three to four shots to kill him. the only grenade launcher that hasn't been changed is parasite--as bungie explained in the patch notes that it already does enough damage on its own. however, the biggest noticeable change is to anarchy, which outputs around 33,500 damage per tick with two single shots, and a grand total of 321,456 damage. the damage only stopped rising due to the fact that partisan died before the game could register anymore. at high-energy fire, the dps dramatically also increases to 40,300 damage per tick. it's unclear at this time if bungie is aware of the issue, but players are hoping a hotfix will be implemented before the day one raid race begins on friday. if you're looking for some season 18 guidance, here's how to get map fragments, treasure coordinates, and maps in season of plunder, as well as a helpful ketchcrash guide on how to complete the season's activity. yesterday, the bungie unveiled destiny 2: lightfall, the latest expansion that is set to arrive on february 28, 2023.\",\"sentenses\":[\"almost all destiny 2 heavy grenade launchers disabled because they're way too good.\",\"update: well, it's clear bungie has taken notice of destiny 2's overpowered heavy grenade launchers.\",\"it's taken the drastic step of disabling all non-sunset heavy grenade launchers, with a few exceptions.\",\"uncommon rarity ones can still be used, as can two exotics: salvation's grip and parasite, the latter of which was exempt from the intended buff in this week's patch.\",\"there's no word on when these guns will be reactivated, but any chance of them being used to skate through the king's fall raid this weekend (or any other difficult activity) has now been eliminated.\",\"original story: it looks like bungie may have accidentally buffed destiny 2's heavy grenade launchers more than it originally intended to, as players discover they now do massive amounts of damage to enemies.\",\"as reported by destiny 2 youtuber fallout plays, it's been discovered that although heavy grenade launchers were supposed to get a 10% buff in pve against majors and above, their damage output has instead been increased 2.5 times the original amount.\",\"this means all heavy grenade launchers, including anarchy, have a 150% buff making them incredibly overpowered.\",\"one player named skywarrior provided fallout plays with a damage chart prior to the patch showing that the average dps for the heavy grenade launcher was around 18,198 in season of the haunted.\",\"now, in season of plunder, the chart shows that it has skyrocketed to over 41,345. fallout plays demonstrated the power of the weapon on the boss shayotet partisan, showing that it only takes three to four shots to kill him.\",\"the only grenade launcher that hasn't been changed is parasite--as bungie explained in the patch notes that it already does enough damage on its own.\",\"however, the biggest noticeable change is to anarchy, which outputs around 33,500 damage per tick with two single shots, and a grand total of 321,456 damage.\",\"the damage only stopped rising due to the fact that partisan died before the game could register anymore.\",\"at high-energy fire, the dps dramatically also increases to 40,300 damage per tick.\",\"it's unclear at this time if bungie is aware of the issue, but players are hoping a hotfix will be implemented before the day one raid race begins on friday.\",\"if you're looking for some season 18 guidance, here's how to get map fragments, treasure coordinates, and maps in season of plunder, as well as a helpful ketchcrash guide on how to complete the season's activity.\",\"yesterday, the bungie unveiled destiny 2: lightfall, the latest expansion that is set to arrive on february 28, 2023.\"],\"tokenized_text\":[\"[almost, all, destiny, 2, heavy, grenade, launchers, disabled, because, they, 're, way, too, good, .]\",\"[update, :, well, ,, it, 's, clear, bungie, has, taken, notice, of, destiny, 2, 's, overpowered, heavy, grenade, launchers, .]\",\"[it, 's, taken, the, drastic, step, of, disabling, all, non-sunset, heavy, grenade, launchers, ,, with, a, few, exceptions, .]\",\"[uncommon, rarity, ones, can, still, be, used, ,, as, can, two, exotics, :, salvation, 's, grip, and, parasite, ,, the, latter, of, which, was, exempt, from, the, intended, buff, in, this, week, 's, patch, .]\",\"[there, 's, no, word, on, when, these, guns, will, be, reactivated, ,, but, any, chance, of, them, being, used, to, skate, through, the, king, 's, fall, raid, this, weekend, (, or, any, other, difficult, activity, ), has, now, been, eliminated, .]\",\"[original, story, :, it, looks, like, bungie, may, have, accidentally, buffed, destiny, 2, 's, heavy, grenade, launchers, more, than, it, originally, intended, to, ,, as, players, discover, they, now, do, massive, amounts, of, damage, to, enemies, .]\",\"[as, reported, by, destiny, 2, youtuber, fallout, plays, ,, it, 's, been, discovered, that, although, heavy, grenade, launchers, were, supposed, to, get, a, 10, %, buff, in, pve, against, majors, and, above, ,, their, damage, output, has, instead, been, increased, 2.5, times, the, original, amount, .]\",\"[this, means, all, heavy, grenade, launchers, ,, including, anarchy, ,, have, a, 150, %, buff, making, them, incredibly, overpowered, .]\",\"[one, player, named, skywarrior, provided, fallout, plays, with, a, damage, chart, prior, to, the, patch, showing, that, the, average, dps, for, the, heavy, grenade, launcher, was, around, 18,198, in, season, of, the, haunted, .]\",\"[now, ,, in, season, of, plunder, ,, the, chart, shows, that, it, has, skyrocketed, to, over, 41,345., fallout, plays, demonstrated, the, power, of, the, weapon, on, the, boss, shayotet, partisan, ,, showing, that, it, only, takes, three, to, four, shots, to, kill, him, .]\",\"[the, only, grenade, launcher, that, has, n't, been, changed, is, parasite, --, as, bungie, explained, in, the, patch, notes, that, it, already, does, enough, damage, on, its, own, .]\",\"[however, ,, the, biggest, noticeable, change, is, to, anarchy, ,, which, outputs, around, 33,500, damage, per, tick, with, two, single, shots, ,, and, a, grand, total, of, 321,456, damage, .]\",\"[the, damage, only, stopped, rising, due, to, the, fact, that, partisan, died, before, the, game, could, register, anymore, .]\",\"[at, high-energy, fire, ,, the, dps, dramatically, also, increases, to, 40,300, damage, per, tick, .]\",\"[it, 's, unclear, at, this, time, if, bungie, is, aware, of, the, issue, ,, but, players, are, hoping, a, hotfix, will, be, implemented, before, the, day, one, raid, race, begins, on, friday, .]\",\"[if, you, 're, looking, for, some, season, 18, guidance, ,, here, 's, how, to, get, map, fragments, ,, treasure, coordinates, ,, and, maps, in, season, of, plunder, ,, as, well, as, a, helpful, ketchcrash, guide, on, how, to, complete, the, season, 's, activity, .]\",\"[yesterday, ,, the, bungie, unveiled, destiny, 2, :, lightfall, ,, the, latest, expansion, that, is, set, to, arrive, on, february, 28, ,, 2023, .]\"],\"BIO\":[[[\"yesterday\",\"O\"],[\",\",\"O\"],[\"the\",\"O\"],[\"bungie\",\"O\"],[\"unveiled\",\"O\"],[\"destiny\",\"B-game\"],[\"2\",\"I-game\"],[\":\",\"I-game\"],[\"lightfall\",\"I-game\"],[\",\",\"O\"],[\"the\",\"O\"],[\"latest\",\"O\"],[\"expansion\",\"O\"],[\"that\",\"O\"],[\"is\",\"O\"],[\"set\",\"O\"],[\"to\",\"O\"],[\"arrive\",\"O\"],[\"on\",\"O\"],[\"february\",\"O\"],[\"28\",\"O\"],[\",\",\"O\"],[\"2023\",\"O\"],[\".\",\"O\"]]]}", "{\"_id\":2,\"title\":\"Dev Delays New Game Due To Feeling \\\"Manipulated\\\" By Its Publisher\",\"text\":[{\"isTitle\":false,\"pos\":0,\"text\":\"Toge Productions and Mojiken announced that A Space for the Unbound has been indefinitely delayed due to “feeling manipulated” by the game’s western console publisher, PQube.\"},{\"isTitle\":false,\"pos\":1,\"text\":\"Back in August 2020, PQube secured a diversity fund from a \\\"well-known console platform\\\" to help fund underrepresented developers, as the studio is based in Indonesia. However, Toge claims that PQube did not grant those funds directly to the developer but instead withheld them for their own financial and commercial gain.\"},{\"isTitle\":false,\"pos\":2,\"text\":\"In a statement on Twitter, Toge Productions said, “Rather than paying the grant money to us, PQube Games hid the facts about the grant’s award and added it as a recoupable minimum guarantee, and then used it to negotiate the increase of their revenue share. We have only uncovered the true amount of these funds and their intended purposes in March 2022.”\"},{\"isTitle\":false,\"pos\":3,\"text\":\"The statement continued, saying, “We are absolutely heartbroken that a party we worked with would do this and a project we have worked on for seven years has been taken advantage of in such a way. Since the uncovering of this issue, we clearly cannot trust PQube Games nor continue to work together for the release of A Space for the Unbound as PQube Games has fallen considerably short not only of reasonable decency but also of their obligations to us due to these predatory practices.”\"},{\"isTitle\":false,\"pos\":5,\"text\":\"PQube issued a statement to GamingonLinux, saying, “We have honored all obligations of our publishing agreement and have supported Toge Productions at every stage of product development throughout their delays and difficulties. This support has included offering significant further funding, over and above grant funding, to support development, porting, and marketing.”\"},{\"isTitle\":false,\"pos\":6,\"text\":\"PQube claims that Toge Productions has tried to enforce unreasonable revisions to their term agreements and the publisher has tried to accommodate. PQube also expressed disappointment that Toge made a public statement about this, but the publisher insists that it will respond to these allegations through appropriate channels.\"},{\"isTitle\":false,\"pos\":7,\"text\":\"Toge Productions has since terminated its own contract with PQube. According to Toge, however, PQube is not handing over the publishing rights for the console version of A Space for the Unbound, so the game is being put on hold until arrangements are made.\"},{\"isTitle\":false,\"pos\":8,\"text\":\"A Space for the Unbound was announced in 2020 and is a sci-fi slice-of-life adventure game taking place in 1990s Indonesia.\"}],\"full_text\":\"dev delays new game due to feeling \\\"manipulated\\\" by its publisher.  toge productions and mojiken announced that a space for the unbound has been indefinitely delayed due to “feeling manipulated” by the game’s western console publisher, pqube. back in august 2020, pqube secured a diversity fund from a \\\"well-known console platform\\\" to help fund underrepresented developers, as the studio is based in indonesia. however, toge claims that pqube did not grant those funds directly to the developer but instead withheld them for their own financial and commercial gain. in a statement on twitter, toge productions said, “rather than paying the grant money to us, pqube games hid the facts about the grant’s award and added it as a recoupable minimum guarantee, and then used it to negotiate the increase of their revenue share. we have only uncovered the true amount of these funds and their intended purposes in march 2022.” the statement continued, saying, “we are absolutely heartbroken that a party we worked with would do this and a project we have worked on for seven years has been taken advantage of in such a way. since the uncovering of this issue, we clearly cannot trust pqube games nor continue to work together for the release of a space for the unbound as pqube games has fallen considerably short not only of reasonable decency but also of their obligations to us due to these predatory practices.” pqube issued a statement to gamingonlinux, saying, “we have honored all obligations of our publishing agreement and have supported toge productions at every stage of product development throughout their delays and difficulties. this support has included offering significant further funding, over and above grant funding, to support development, porting, and marketing.” pqube claims that toge productions has tried to enforce unreasonable revisions to their term agreements and the publisher has tried to accommodate. pqube also expressed disappointment that toge made a public statement about this, but the publisher insists that it will respond to these allegations through appropriate channels. toge productions has since terminated its own contract with pqube. according to toge, however, pqube is not handing over the publishing rights for the console version of a space for the unbound, so the game is being put on hold until arrangements are made. a space for the unbound was announced in 2020 and is a sci-fi slice-of-life adventure game taking place in 1990s indonesia.\",\"sentenses\":[\"dev delays new game due to feeling \\\"manipulated\\\" by its publisher.\",\"toge productions and mojiken announced that a space for the unbound has been indefinitely delayed due to “feeling manipulated” by the game’s western console publisher, pqube.\",\"back in august 2020, pqube secured a diversity fund from a \\\"well-known console platform\\\" to help fund underrepresented developers, as the studio is based in indonesia.\",\"however, toge claims that pqube did not grant those funds directly to the developer but instead withheld them for their own financial and commercial gain.\",\"in a statement on twitter, toge productions said, “rather than paying the grant money to us, pqube games hid the facts about the grant’s award and added it as a recoupable minimum guarantee, and then used it to negotiate the increase of their revenue share.\",\"we have only uncovered the true amount of these funds and their intended purposes in march 2022.” the statement continued, saying, “we are absolutely heartbroken that a party we worked with would do this and a project we have worked on for seven years has been taken advantage of in such a way.\",\"since the uncovering of this issue, we clearly cannot trust pqube games nor continue to work together for the release of a space for the unbound as pqube games has fallen considerably short not only of reasonable decency but also of their obligations to us due to these predatory practices.” pqube issued a statement to gamingonlinux, saying, “we have honored all obligations of our publishing agreement and have supported toge productions at every stage of product development throughout their delays and difficulties.\",\"this support has included offering significant further funding, over and above grant funding, to support development, porting, and marketing.” pqube claims that toge productions has tried to enforce unreasonable revisions to their term agreements and the publisher has tried to accommodate.\",\"pqube also expressed disappointment that toge made a public statement about this, but the publisher insists that it will respond to these allegations through appropriate channels.\",\"toge productions has since terminated its own contract with pqube.\",\"according to toge, however, pqube is not handing over the publishing rights for the console version of a space for the unbound, so the game is being put on hold until arrangements are made.\",\"a space for the unbound was announced in 2020 and is a sci-fi slice-of-life adventure game taking place in 1990s indonesia.\"],\"tokenized_text\":[\"[dev, delays, new, game, due, to, feeling, ``, manipulated, '', by, its, publisher, .]\",\"[toge, productions, and, mojiken, announced, that, a, space, for, the, unbound, has, been, indefinitely, delayed, due, to, “, feeling, manipulated, ”, by, the, game, ’, s, western, console, publisher, ,, pqube, .]\",\"[back, in, august, 2020, ,, pqube, secured, a, diversity, fund, from, a, ``, well-known, console, platform, '', to, help, fund, underrepresented, developers, ,, as, the, studio, is, based, in, indonesia, .]\",\"[however, ,, toge, claims, that, pqube, did, not, grant, those, funds, directly, to, the, developer, but, instead, withheld, them, for, their, own, financial, and, commercial, gain, .]\",\"[in, a, statement, on, twitter, ,, toge, productions, said, ,, “, rather, than, paying, the, grant, money, to, us, ,, pqube, games, hid, the, facts, about, the, grant, ’, s, award, and, added, it, as, a, recoupable, minimum, guarantee, ,, and, then, used, it, to, negotiate, the, increase, of, their, revenue, share, .]\",\"[we, have, only, uncovered, the, true, amount, of, these, funds, and, their, intended, purposes, in, march, 2022., ”, the, statement, continued, ,, saying, ,, “, we, are, absolutely, heartbroken, that, a, party, we, worked, with, would, do, this, and, a, project, we, have, worked, on, for, seven, years, has, been, taken, advantage, of, in, such, a, way, .]\",\"[since, the, uncovering, of, this, issue, ,, we, clearly, can, not, trust, pqube, games, nor, continue, to, work, together, for, the, release, of, a, space, for, the, unbound, as, pqube, games, has, fallen, considerably, short, not, only, of, reasonable, decency, but, also, of, their, obligations, to, us, due, to, these, predatory, practices., ”, pqube, issued, a, statement, to, gamingonlinux, ,, saying, ,, “, we, have, honored, all, obligations, of, our, publishing, agreement, and, have, supported, toge, productions, at, every, stage, of, product, development, throughout, their, delays, and, difficulties, .]\",\"[this, support, has, included, offering, significant, further, funding, ,, over, and, above, grant, funding, ,, to, support, development, ,, porting, ,, and, marketing., ”, pqube, claims, that, toge, productions, has, tried, to, enforce, unreasonable, revisions, to, their, term, agreements, and, the, publisher, has, tried, to, accommodate, .]\",\"[pqube, also, expressed, disappointment, that, toge, made, a, public, statement, about, this, ,, but, the, publisher, insists, that, it, will, respond, to, these, allegations, through, appropriate, channels, .]\",\"[toge, productions, has, since, terminated, its, own, contract, with, pqube, .]\",\"[according, to, toge, ,, however, ,, pqube, is, not, handing, over, the, publishing, rights, for, the, console, version, of, a, space, for, the, unbound, ,, so, the, game, is, being, put, on, hold, until, arrangements, are, made, .]\",\"[a, space, for, the, unbound, was, announced, in, 2020, and, is, a, sci-fi, slice-of-life, adventure, game, taking, place, in, 1990s, indonesia, .]\"],\"BIO\":[[[\"toge\",\"O\"],[\"productions\",\"O\"],[\"and\",\"O\"],[\"mojiken\",\"O\"],[\"announced\",\"O\"],[\"that\",\"O\"],[\"a\",\"B-game\"],[\"space\",\"I-game\"],[\"for\",\"I-game\"],[\"the\",\"I-game\"],[\"unbound\",\"I-game\"],[\"has\",\"O\"],[\"been\",\"O\"],[\"indefinitely\",\"O\"],[\"delayed\",\"O\"],[\"due\",\"O\"],[\"to\",\"O\"],[\"“\",\"O\"],[\"feeling\",\"O\"],[\"manipulated\",\"O\"],[\"”\",\"O\"],[\"by\",\"O\"],[\"the\",\"O\"],[\"game\",\"O\"],[\"’\",\"O\"],[\"s\",\"O\"],[\"western\",\"O\"],[\"console\",\"O\"],[\"publisher\",\"O\"],[\",\",\"O\"],[\"pqube\",\"O\"],[\".\",\"O\"]],[[\"since\",\"O\"],[\"the\",\"O\"],[\"uncovering\",\"O\"],[\"of\",\"O\"],[\"this\",\"O\"],[\"issue\",\"O\"],[\",\",\"O\"],[\"we\",\"O\"],[\"clearly\",\"O\"],[\"can\",\"O\"],[\"not\",\"O\"],[\"trust\",\"O\"],[\"pqube\",\"O\"],[\"games\",\"O\"],[\"nor\",\"O\"],[\"continue\",\"O\"],[\"to\",\"O\"],[\"work\",\"O\"],[\"together\",\"O\"],[\"for\",\"O\"],[\"the\",\"O\"],[\"release\",\"O\"],[\"of\",\"O\"],[\"a\",\"B-game\"],[\"space\",\"I-game\"],[\"for\",\"I-game\"],[\"the\",\"I-game\"],[\"unbound\",\"I-game\"],[\"as\",\"O\"],[\"pqube\",\"O\"],[\"games\",\"O\"],[\"has\",\"O\"],[\"fallen\",\"O\"],[\"considerably\",\"O\"],[\"short\",\"O\"],[\"not\",\"O\"],[\"only\",\"O\"],[\"of\",\"O\"],[\"reasonable\",\"O\"],[\"decency\",\"O\"],[\"but\",\"O\"],[\"also\",\"O\"],[\"of\",\"O\"],[\"their\",\"O\"],[\"obligations\",\"O\"],[\"to\",\"O\"],[\"us\",\"O\"],[\"due\",\"O\"],[\"to\",\"O\"],[\"these\",\"O\"],[\"predatory\",\"O\"],[\"practices.\",\"O\"],[\"”\",\"O\"],[\"pqube\",\"O\"],[\"issued\",\"O\"],[\"a\",\"O\"],[\"statement\",\"O\"],[\"to\",\"O\"],[\"gamingonlinux\",\"O\"],[\",\",\"O\"],[\"saying\",\"O\"],[\",\",\"O\"],[\"“\",\"O\"],[\"we\",\"O\"],[\"have\",\"O\"],[\"honored\",\"O\"],[\"all\",\"O\"],[\"obligations\",\"O\"],[\"of\",\"O\"],[\"our\",\"O\"],[\"publishing\",\"O\"],[\"agreement\",\"O\"],[\"and\",\"O\"],[\"have\",\"O\"],[\"supported\",\"O\"],[\"toge\",\"O\"],[\"productions\",\"O\"],[\"at\",\"O\"],[\"every\",\"O\"],[\"stage\",\"O\"],[\"of\",\"O\"],[\"product\",\"O\"],[\"development\",\"O\"],[\"throughout\",\"O\"],[\"their\",\"O\"],[\"delays\",\"O\"],[\"and\",\"O\"],[\"difficulties\",\"O\"],[\".\",\"O\"]],[[\"according\",\"O\"],[\"to\",\"O\"],[\"toge\",\"O\"],[\",\",\"O\"],[\"however\",\"O\"],[\",\",\"O\"],[\"pqube\",\"O\"],[\"is\",\"O\"],[\"not\",\"O\"],[\"handing\",\"O\"],[\"over\",\"O\"],[\"the\",\"O\"],[\"publishing\",\"O\"],[\"rights\",\"O\"],[\"for\",\"O\"],[\"the\",\"O\"],[\"console\",\"O\"],[\"version\",\"O\"],[\"of\",\"O\"],[\"a\",\"B-game\"],[\"space\",\"I-game\"],[\"for\",\"I-game\"],[\"the\",\"I-game\"],[\"unbound\",\"I-game\"],[\",\",\"O\"],[\"so\",\"O\"],[\"the\",\"O\"],[\"game\",\"O\"],[\"is\",\"O\"],[\"being\",\"O\"],[\"put\",\"O\"],[\"on\",\"O\"],[\"hold\",\"O\"],[\"until\",\"O\"],[\"arrangements\",\"O\"],[\"are\",\"O\"],[\"made\",\"O\"],[\".\",\"O\"]],[[\"a\",\"B-game\"],[\"space\",\"I-game\"],[\"for\",\"I-game\"],[\"the\",\"I-game\"],[\"unbound\",\"I-game\"],[\"was\",\"O\"],[\"announced\",\"O\"],[\"in\",\"O\"],[\"2020\",\"O\"],[\"and\",\"O\"],[\"is\",\"O\"],[\"a\",\"O\"],[\"sci-fi\",\"O\"],[\"slice-of-life\",\"O\"],[\"adventure\",\"O\"],[\"game\",\"O\"],[\"taking\",\"O\"],[\"place\",\"O\"],[\"in\",\"O\"],[\"1990s\",\"O\"],[\"indonesia\",\"O\"],[\".\",\"O\"]]]}", "{\"_id\":4,\"title\":\"Shazam: Fury Of The Gods Delayed To 2023, Pushes Back Aquaman And The Lost Kingdom\",\"text\":[{\"isTitle\":false,\"pos\":0,\"text\":\"Some of our favorite superheroes are going to be a little bit later than expected--good thing there isn't a bus teetering on the edge of an overpass. Shazam: Fury of the Gods and Aquaman and the Lost Kingdom are both being pushed back as part of a greater shuffling of the Warner Bros. theatrical calendar, Variety reports.\"},{\"isTitle\":false,\"pos\":1,\"text\":\"The Shazam sequel was previously set to release this Christmas on December 21, with Aquaman hitting on March 17, 2023. Now, Shazam will debut in Aquaman's spot on March 17, with Aquaman releasing on December 25, 2023. The date for the other big upcoming DC films, Black Adam and The Flash, have not yet moved from their respective October 22, 2022 and June 23, 2023 release dates.\"},{\"isTitle\":false,\"pos\":2,\"text\":\"Also announced as part of the shuffle, an \\\"untitled WB event film\\\" will release on February 10, 2023. Evil Dead Rise releases on April 4, and The Nun 2 on September 8. Salem's Lot, based on the 1975 Stephen King novel, was set to release on April 21, but will now release on an unannounced date sometime in 2023.\"},{\"isTitle\":false,\"pos\":3,\"text\":\"Evil Dead Rise and House Party, Variety notes, were both originally going to release on HBO Max. As part of Warner Bros. Discovery's new theater-first strategy, however, both will play exclusively in theaters.\"},{\"isTitle\":false,\"pos\":4,\"text\":\"Warner Bros. Discovery has been in the news quite a bit this summer. CEO David Zaslav has a ten-year plan for Warner Bros., which began with the surprise cancelation of the nearly-finished Batgirl. Meanwhile, Ezra Miller's continued legal trouble has called into question the future of The Flash among fans, but Zaslav had only positive things to say about the film during a recent company conference call, and no move has yet been announced for the film.\"}],\"full_text\":\"shazam: fury of the gods delayed to 2023, pushes back aquaman and the lost kingdom.  some of our favorite superheroes are going to be a little bit later than expected--good thing there isn't a bus teetering on the edge of an overpass. shazam: fury of the gods and aquaman and the lost kingdom are both being pushed back as part of a greater shuffling of the warner bros. theatrical calendar, variety reports. the shazam sequel was previously set to release this christmas on december 21, with aquaman hitting on march 17, 2023. now, shazam will debut in aquaman's spot on march 17, with aquaman releasing on december 25, 2023. the date for the other big upcoming dc films, black adam and the flash, have not yet moved from their respective october 22, 2022 and june 23, 2023 release dates. also announced as part of the shuffle, an \\\"untitled wb event film\\\" will release on february 10, 2023. evil dead rise releases on april 4, and the nun 2 on september 8. salem's lot, based on the 1975 stephen king novel, was set to release on april 21, but will now release on an unannounced date sometime in 2023. evil dead rise and house party, variety notes, were both originally going to release on hbo max. as part of warner bros. discovery's new theater-first strategy, however, both will play exclusively in theaters. warner bros. discovery has been in the news quite a bit this summer. ceo david zaslav has a ten-year plan for warner bros., which began with the surprise cancelation of the nearly-finished batgirl. meanwhile, ezra miller's continued legal trouble has called into question the future of the flash among fans, but zaslav had only positive things to say about the film during a recent company conference call, and no move has yet been announced for the film.\",\"sentenses\":[\"shazam: fury of the gods delayed to 2023, pushes back aquaman and the lost kingdom.\",\"some of our favorite superheroes are going to be a little bit later than expected--good thing there isn't a bus teetering on the edge of an overpass.\",\"shazam: fury of the gods and aquaman and the lost kingdom are both being pushed back as part of a greater shuffling of the warner bros. theatrical calendar, variety reports.\",\"the shazam sequel was previously set to release this christmas on december 21, with aquaman hitting on march 17, 2023. now, shazam will debut in aquaman's spot on march 17, with aquaman releasing on december 25, 2023. the date for the other big upcoming dc films, black adam and the flash, have not yet moved from their respective october 22, 2022 and june 23, 2023 release dates.\",\"also announced as part of the shuffle, an \\\"untitled wb event film\\\" will release on february 10, 2023. evil dead rise releases on april 4, and the nun 2 on september 8. salem's lot, based on the 1975 stephen king novel, was set to release on april 21, but will now release on an unannounced date sometime in 2023. evil dead rise and house party, variety notes, were both originally going to release on hbo max.\",\"as part of warner bros. discovery's new theater-first strategy, however, both will play exclusively in theaters.\",\"warner bros. discovery has been in the news quite a bit this summer.\",\"ceo david zaslav has a ten-year plan for warner bros., which began with the surprise cancelation of the nearly-finished batgirl.\",\"meanwhile, ezra miller's continued legal trouble has called into question the future of the flash among fans, but zaslav had only positive things to say about the film during a recent company conference call, and no move has yet been announced for the film.\"],\"tokenized_text\":[\"[shazam, :, fury, of, the, gods, delayed, to, 2023, ,, pushes, back, aquaman, and, the, lost, kingdom, .]\",\"[some, of, our, favorite, superheroes, are, going, to, be, a, little, bit, later, than, expected, --, good, thing, there, is, n't, a, bus, teetering, on, the, edge, of, an, overpass, .]\",\"[shazam, :, fury, of, the, gods, and, aquaman, and, the, lost, kingdom, are, both, being, pushed, back, as, part, of, a, greater, shuffling, of, the, warner, bros., theatrical, calendar, ,, variety, reports, .]\",\"[the, shazam, sequel, was, previously, set, to, release, this, christmas, on, december, 21, ,, with, aquaman, hitting, on, march, 17, ,, 2023., now, ,, shazam, will, debut, in, aquaman, 's, spot, on, march, 17, ,, with, aquaman, releasing, on, december, 25, ,, 2023., the, date, for, the, other, big, upcoming, dc, films, ,, black, adam, and, the, flash, ,, have, not, yet, moved, from, their, respective, october, 22, ,, 2022, and, june, 23, ,, 2023, release, dates, .]\",\"[also, announced, as, part, of, the, shuffle, ,, an, ``, untitled, wb, event, film, '', will, release, on, february, 10, ,, 2023., evil, dead, rise, releases, on, april, 4, ,, and, the, nun, 2, on, september, 8., salem, 's, lot, ,, based, on, the, 1975, stephen, king, novel, ,, was, set, to, release, on, april, 21, ,, but, will, now, release, on, an, unannounced, date, sometime, in, 2023., evil, dead, rise, and, house, party, ,, variety, notes, ,, were, both, originally, going, to, release, on, hbo, max, .]\",\"[as, part, of, warner, bros., discovery, 's, new, theater-first, strategy, ,, however, ,, both, will, play, exclusively, in, theaters, .]\",\"[warner, bros., discovery, has, been, in, the, news, quite, a, bit, this, summer, .]\",\"[ceo, david, zaslav, has, a, ten-year, plan, for, warner, bros., ,, which, began, with, the, surprise, cancelation, of, the, nearly-finished, batgirl, .]\",\"[meanwhile, ,, ezra, miller, 's, continued, legal, trouble, has, called, into, question, the, future, of, the, flash, among, fans, ,, but, zaslav, had, only, positive, things, to, say, about, the, film, during, a, recent, company, conference, call, ,, and, no, move, has, yet, been, announced, for, the, film, .]\"],\"BIO\":[[[\"also\",\"O\"],[\"announced\",\"O\"],[\"as\",\"O\"],[\"part\",\"O\"],[\"of\",\"O\"],[\"the\",\"O\"],[\"shuffle\",\"O\"],[\",\",\"O\"],[\"an\",\"O\"],[\"``\",\"O\"],[\"untitled\",\"O\"],[\"wb\",\"O\"],[\"event\",\"O\"],[\"film\",\"O\"],[\"''\",\"O\"],[\"will\",\"O\"],[\"release\",\"O\"],[\"on\",\"O\"],[\"february\",\"O\"],[\"10\",\"O\"],[\",\",\"O\"],[\"2023.\",\"O\"],[\"evil\",\"O\"],[\"dead\",\"O\"],[\"rise\",\"O\"],[\"releases\",\"O\"],[\"on\",\"O\"],[\"april\",\"O\"],[\"4\",\"O\"],[\",\",\"O\"],[\"and\",\"O\"],[\"the\",\"O\"],[\"nun\",\"O\"],[\"2\",\"O\"],[\"on\",\"O\"],[\"september\",\"O\"],[\"8.\",\"O\"],[\"salem\",\"O\"],[\"'s\",\"O\"],[\"lot\",\"O\"],[\",\",\"O\"],[\"based\",\"O\"],[\"on\",\"O\"],[\"the\",\"O\"],[\"1975\",\"O\"],[\"stephen\",\"O\"],[\"king\",\"O\"],[\"novel\",\"O\"],[\",\",\"O\"],[\"was\",\"O\"],[\"set\",\"O\"],[\"to\",\"O\"],[\"release\",\"O\"],[\"on\",\"O\"],[\"april\",\"O\"],[\"21\",\"O\"],[\",\",\"O\"],[\"but\",\"O\"],[\"will\",\"O\"],[\"now\",\"O\"],[\"release\",\"O\"],[\"on\",\"O\"],[\"an\",\"O\"],[\"unannounced\",\"O\"],[\"date\",\"O\"],[\"sometime\",\"O\"],[\"in\",\"O\"],[\"2023.\",\"O\"],[\"evil\",\"O\"],[\"dead\",\"O\"],[\"rise\",\"O\"],[\"and\",\"O\"],[\"house\",\"B-game\"],[\"party\",\"I-game\"],[\",\",\"O\"],[\"variety\",\"O\"],[\"notes\",\"O\"],[\",\",\"O\"],[\"were\",\"O\"],[\"both\",\"O\"],[\"originally\",\"O\"],[\"going\",\"O\"],[\"to\",\"O\"],[\"release\",\"O\"],[\"on\",\"O\"],[\"hbo\",\"O\"],[\"max\",\"O\"],[\".\",\"O\"]]]}", "{\"_id\":5,\"title\":\"Ni No Kuni: Cross Worlds' Latest Update Adds Competitive Cooking\",\"text\":[{\"isTitle\":false,\"pos\":0,\"text\":\"Netmarble has announced a new update for its RPG mobile game Ni No Kuni: Cross Worlds. The latest update will allow players to participate in a new episode and features limited-time events and rewards.\"},{\"isTitle\":false,\"pos\":1,\"text\":\"Players can now participate in the Cooking Competition episode, and in it, they'll be able to play new dungeons and quests. New character customizations such as the Chef Outfit and Sweets Cart Mount have been added to celebrate the event. The new update will also include a new Favor System allowing players to build friendships with NPCs by interacting with them. They'll also be able to build friendships with characters who take care of their crops in the Familiars' Forest.\"},{\"isTitle\":false,\"pos\":2,\"text\":\"To celebrate the 100th day anniversary of the game's launch, Netmarble will reward players with daily check-in rewards that'll last 28 days. Players who log in daily will be eligible for rewards such as a Six-star Dimensional Deer and a Four-star Equipment Selection Chest.\"},{\"isTitle\":false,\"pos\":3,\"text\":\"In addition to all the new content, players can play the Sore Boar Power Up Event. Those who complete the event will be rewarded with Sore Boar and Familiar power-up materials.\"},{\"isTitle\":false,\"pos\":4,\"text\":\"Ni no Kuni: Cross Worlds is a free-to-play mobile game. You can download it on the Apple App Store and Google Play.\"},{\"isTitle\":false,\"pos\":5,\"text\":\"For more mobile gaming news, check out these stories:\"}],\"full_text\":\"ni no kuni: cross worlds' latest update adds competitive cooking.  netmarble has announced a new update for its rpg mobile game ni no kuni: cross worlds. the latest update will allow players to participate in a new episode and features limited-time events and rewards. players can now participate in the cooking competition episode, and in it, they'll be able to play new dungeons and quests. new character customizations such as the chef outfit and sweets cart mount have been added to celebrate the event. the new update will also include a new favor system allowing players to build friendships with npcs by interacting with them. they'll also be able to build friendships with characters who take care of their crops in the familiars' forest. to celebrate the 100th day anniversary of the game's launch, netmarble will reward players with daily check-in rewards that'll last 28 days. players who log in daily will be eligible for rewards such as a six-star dimensional deer and a four-star equipment selection chest. in addition to all the new content, players can play the sore boar power up event. those who complete the event will be rewarded with sore boar and familiar power-up materials. ni no kuni: cross worlds is a free-to-play mobile game. you can download it on the apple app store and google play. for more mobile gaming news, check out these stories:\",\"sentenses\":[\"ni no kuni: cross worlds' latest update adds competitive cooking.\",\"netmarble has announced a new update for its rpg mobile game ni no kuni: cross worlds.\",\"the latest update will allow players to participate in a new episode and features limited-time events and rewards.\",\"players can now participate in the cooking competition episode, and in it, they'll be able to play new dungeons and quests.\",\"new character customizations such as the chef outfit and sweets cart mount have been added to celebrate the event.\",\"the new update will also include a new favor system allowing players to build friendships with npcs by interacting with them.\",\"they'll also be able to build friendships with characters who take care of their crops in the familiars' forest.\",\"to celebrate the 100th day anniversary of the game's launch, netmarble will reward players with daily check-in rewards that'll last 28 days.\",\"players who log in daily will be eligible for rewards such as a six-star dimensional deer and a four-star equipment selection chest.\",\"in addition to all the new content, players can play the sore boar power up event.\",\"those who complete the event will be rewarded with sore boar and familiar power-up materials.\",\"ni no kuni: cross worlds is a free-to-play mobile game.\",\"you can download it on the apple app store and google play.\",\"for more mobile gaming news, check out these stories:\"],\"tokenized_text\":[\"[ni, no, kuni, :, cross, worlds, ', latest, update, adds, competitive, cooking, .]\",\"[netmarble, has, announced, a, new, update, for, its, rpg, mobile, game, ni, no, kuni, :, cross, worlds, .]\",\"[the, latest, update, will, allow, players, to, participate, in, a, new, episode, and, features, limited-time, events, and, rewards, .]\",\"[players, can, now, participate, in, the, cooking, competition, episode, ,, and, in, it, ,, they, 'll, be, able, to, play, new, dungeons, and, quests, .]\",\"[new, character, customizations, such, as, the, chef, outfit, and, sweets, cart, mount, have, been, added, to, celebrate, the, event, .]\",\"[the, new, update, will, also, include, a, new, favor, system, allowing, players, to, build, friendships, with, npcs, by, interacting, with, them, .]\",\"[they, 'll, also, be, able, to, build, friendships, with, characters, who, take, care, of, their, crops, in, the, familiars, ', forest, .]\",\"[to, celebrate, the, 100th, day, anniversary, of, the, game, 's, launch, ,, netmarble, will, reward, players, with, daily, check-in, rewards, that, 'll, last, 28, days, .]\",\"[players, who, log, in, daily, will, be, eligible, for, rewards, such, as, a, six-star, dimensional, deer, and, a, four-star, equipment, selection, chest, .]\",\"[in, addition, to, all, the, new, content, ,, players, can, play, the, sore, boar, power, up, event, .]\",\"[those, who, complete, the, event, will, be, rewarded, with, sore, boar, and, familiar, power-up, materials, .]\",\"[ni, no, kuni, :, cross, worlds, is, a, free-to-play, mobile, game, .]\",\"[you, can, download, it, on, the, apple, app, store, and, google, play, .]\",\"[for, more, mobile, gaming, news, ,, check, out, these, stories, :]\"],\"BIO\":[[[\"ni\",\"B-game\"],[\"no\",\"I-game\"],[\"kuni\",\"I-game\"],[\":\",\"I-game\"],[\"cross\",\"I-game\"],[\"worlds\",\"I-game\"],[\"'\",\"O\"],[\"latest\",\"O\"],[\"update\",\"O\"],[\"adds\",\"O\"],[\"competitive\",\"O\"],[\"cooking\",\"O\"],[\".\",\"O\"]],[[\"netmarble\",\"O\"],[\"has\",\"O\"],[\"announced\",\"O\"],[\"a\",\"O\"],[\"new\",\"O\"],[\"update\",\"O\"],[\"for\",\"O\"],[\"its\",\"O\"],[\"rpg\",\"O\"],[\"mobile\",\"O\"],[\"game\",\"O\"],[\"ni\",\"B-game\"],[\"no\",\"I-game\"],[\"kuni\",\"I-game\"],[\":\",\"I-game\"],[\"cross\",\"I-game\"],[\"worlds\",\"I-game\"],[\".\",\"O\"]],[[\"ni\",\"B-game\"],[\"no\",\"I-game\"],[\"kuni\",\"I-game\"],[\":\",\"I-game\"],[\"cross\",\"I-game\"],[\"worlds\",\"I-game\"],[\"is\",\"O\"],[\"a\",\"O\"],[\"free-to-play\",\"O\"],[\"mobile\",\"O\"],[\"game\",\"O\"],[\".\",\"O\"]]]}", "{\"_id\":14,\"title\":\"Netflix's Horizon Zero Dawn TV Series Gets New Details\",\"text\":[{\"isTitle\":false,\"pos\":0,\"text\":\"Back in May, Sony announced that a Horizon Zero Dawn show is in production, and now details have emerged about the showrunner and the production company behind it. Steve Blackman and his newly-launched Irish Cowboy Productions will be helming the series after it was announced that Blackman had signed a multi-year deal with Netflix. Under the deal, Blackman will write and produce new series and other projects for Netflix including Horizon Zero Dawn and Orbital, an original series by David and Keith Lynch.\"},{\"isTitle\":false,\"pos\":1,\"text\":\"Set thousands of years in the future, Horizon Zero Dawn takes place in the ruins of the United States, but it's filled with high-tech machines and primitive tribes. Machines that were once peaceful begin hunting anything they see as living, and it's up to an outcast named Aloy to uncover the mystery behind why the machines turned and to save the world.\"},{\"isTitle\":false,\"pos\":2,\"text\":\"The game was praised by critics for its open world, story, visuals, combat, characterization, and the performance of voice actress Ashly Burch and won numerous awards as well as sold over 20 million copies by February 2022, making it one of the best-selling PlayStation 4 games.\"},{\"isTitle\":false,\"pos\":3,\"text\":\"\\\"Horizon Zero Dawn and Orbital are elevated, event-level projects grounded in characters that fans will love and relate to, which are hallmarks of Irish Cowboy productions,\\\" said Blackman. \\\"We're thrilled to be working with Netflix and all of our partners on developing these ground-breaking stories.\\\"\"},{\"isTitle\":false,\"pos\":4,\"text\":\"After the series was announced, along with God of War and Gran Turismo, we talked about the best way to approach the adaptation and what to avoid.\"},{\"isTitle\":false,\"pos\":5,\"text\":\"No production start date or premiere date as well as casting has been announced as of yet.\"}],\"full_text\":\"netflix's horizon zero dawn tv series gets new details.  back in may, sony announced that a horizon zero dawn show is in production, and now details have emerged about the showrunner and the production company behind it. steve blackman and his newly-launched irish cowboy productions will be helming the series after it was announced that blackman had signed a multi-year deal with netflix. under the deal, blackman will write and produce new series and other projects for netflix including horizon zero dawn and orbital, an original series by david and keith lynch. set thousands of years in the future, horizon zero dawn takes place in the ruins of the united states, but it's filled with high-tech machines and primitive tribes. machines that were once peaceful begin hunting anything they see as living, and it's up to an outcast named aloy to uncover the mystery behind why the machines turned and to save the world. the game was praised by critics for its open world, story, visuals, combat, characterization, and the performance of voice actress ashly burch and won numerous awards as well as sold over 20 million copies by february 2022, making it one of the best-selling playstation 4 games. \\\"horizon zero dawn and orbital are elevated, event-level projects grounded in characters that fans will love and relate to, which are hallmarks of irish cowboy productions,\\\" said blackman. \\\"we're thrilled to be working with netflix and all of our partners on developing these ground-breaking stories.\\\" after the series was announced, along with god of war and gran turismo, we talked about the best way to approach the adaptation and what to avoid. no production start date or premiere date as well as casting has been announced as of yet.\",\"sentenses\":[\"netflix's horizon zero dawn tv series gets new details.\",\"back in may, sony announced that a horizon zero dawn show is in production, and now details have emerged about the showrunner and the production company behind it.\",\"steve blackman and his newly-launched irish cowboy productions will be helming the series after it was announced that blackman had signed a multi-year deal with netflix.\",\"under the deal, blackman will write and produce new series and other projects for netflix including horizon zero dawn and orbital, an original series by david and keith lynch.\",\"set thousands of years in the future, horizon zero dawn takes place in the ruins of the united states, but it's filled with high-tech machines and primitive tribes.\",\"machines that were once peaceful begin hunting anything they see as living, and it's up to an outcast named aloy to uncover the mystery behind why the machines turned and to save the world.\",\"the game was praised by critics for its open world, story, visuals, combat, characterization, and the performance of voice actress ashly burch and won numerous awards as well as sold over 20 million copies by february 2022, making it one of the best-selling playstation 4 games.\",\"\\\"horizon zero dawn and orbital are elevated, event-level projects grounded in characters that fans will love and relate to, which are hallmarks of irish cowboy productions,\\\" said blackman.\",\"\\\"we're thrilled to be working with netflix and all of our partners on developing these ground-breaking stories.\\\"\",\"after the series was announced, along with god of war and gran turismo, we talked about the best way to approach the adaptation and what to avoid.\",\"no production start date or premiere date as well as casting has been announced as of yet.\"],\"tokenized_text\":[\"[netflix, 's, horizon, zero, dawn, tv, series, gets, new, details, .]\",\"[back, in, may, ,, sony, announced, that, a, horizon, zero, dawn, show, is, in, production, ,, and, now, details, have, emerged, about, the, showrunner, and, the, production, company, behind, it, .]\",\"[steve, blackman, and, his, newly-launched, irish, cowboy, productions, will, be, helming, the, series, after, it, was, announced, that, blackman, had, signed, a, multi-year, deal, with, netflix, .]\",\"[under, the, deal, ,, blackman, will, write, and, produce, new, series, and, other, projects, for, netflix, including, horizon, zero, dawn, and, orbital, ,, an, original, series, by, david, and, keith, lynch, .]\",\"[set, thousands, of, years, in, the, future, ,, horizon, zero, dawn, takes, place, in, the, ruins, of, the, united, states, ,, but, it, 's, filled, with, high-tech, machines, and, primitive, tribes, .]\",\"[machines, that, were, once, peaceful, begin, hunting, anything, they, see, as, living, ,, and, it, 's, up, to, an, outcast, named, aloy, to, uncover, the, mystery, behind, why, the, machines, turned, and, to, save, the, world, .]\",\"[the, game, was, praised, by, critics, for, its, open, world, ,, story, ,, visuals, ,, combat, ,, characterization, ,, and, the, performance, of, voice, actress, ashly, burch, and, won, numerous, awards, as, well, as, sold, over, 20, million, copies, by, february, 2022, ,, making, it, one, of, the, best-selling, playstation, 4, games, .]\",\"[``, horizon, zero, dawn, and, orbital, are, elevated, ,, event-level, projects, grounded, in, characters, that, fans, will, love, and, relate, to, ,, which, are, hallmarks, of, irish, cowboy, productions, ,, '', said, blackman, .]\",\"[``, we, 're, thrilled, to, be, working, with, netflix, and, all, of, our, partners, on, developing, these, ground-breaking, stories, ., '']\",\"[after, the, series, was, announced, ,, along, with, god, of, war, and, gran, turismo, ,, we, talked, about, the, best, way, to, approach, the, adaptation, and, what, to, avoid, .]\",\"[no, production, start, date, or, premiere, date, as, well, as, casting, has, been, announced, as, of, yet, .]\"],\"BIO\":[[[\"``\",\"O\"],[\"horizon\",\"O\"],[\"zero\",\"O\"],[\"dawn\",\"O\"],[\"and\",\"O\"],[\"orbital\",\"O\"],[\"are\",\"O\"],[\"elevated\",\"O\"],[\",\",\"O\"],[\"event-level\",\"O\"],[\"projects\",\"O\"],[\"grounded\",\"B-game\"],[\"in\",\"O\"],[\"characters\",\"O\"],[\"that\",\"O\"],[\"fans\",\"O\"],[\"will\",\"O\"],[\"love\",\"O\"],[\"and\",\"O\"],[\"relate\",\"O\"],[\"to\",\"O\"],[\",\",\"O\"],[\"which\",\"O\"],[\"are\",\"O\"],[\"hallmarks\",\"O\"],[\"of\",\"O\"],[\"irish\",\"O\"],[\"cowboy\",\"O\"],[\"productions\",\"O\"],[\",\",\"O\"],[\"''\",\"O\"],[\"said\",\"O\"],[\"blackman\",\"O\"],[\".\",\"O\"]],[[\"after\",\"O\"],[\"the\",\"O\"],[\"series\",\"O\"],[\"was\",\"O\"],[\"announced\",\"O\"],[\",\",\"O\"],[\"along\",\"O\"],[\"with\",\"O\"],[\"god\",\"B-game\"],[\"of\",\"I-game\"],[\"war\",\"I-game\"],[\"and\",\"O\"],[\"gran\",\"O\"],[\"turismo\",\"O\"],[\",\",\"O\"],[\"we\",\"O\"],[\"talked\",\"O\"],[\"about\",\"O\"],[\"the\",\"O\"],[\"best\",\"O\"],[\"way\",\"O\"],[\"to\",\"O\"],[\"approach\",\"O\"],[\"the\",\"O\"],[\"adaptation\",\"O\"],[\"and\",\"O\"],[\"what\",\"O\"],[\"to\",\"O\"],[\"avoid\",\"O\"],[\".\",\"O\"]]]}", "{\"_id\":19,\"title\":\"Where To Find The Glow, Groovy Grove, And Fungi Farm Locations In Fortnite\",\"text\":[{\"isTitle\":false,\"pos\":0,\"text\":\"If you've just booted up Fortnite for the first time this week, you may notice there is a fresh set of challenges for you to complete. If you want to maximize your XP gain, you'll want to knock all of them out, including a somewhat vaguely explained one that asks you to land at Groovy Grove or Fungi Farm and travel to The Glow in a single match. If you're left wondering exactly how to wrap up this challenge, we've got you covered below, including an easily marked map location for The Glow, as well as both starting points.\"},{\"isTitle\":true,\"pos\":1,\"text\":\"Where is The Glow in Fortnite\"},{\"isTitle\":false,\"pos\":2,\"text\":\"This Week 12 challenge requests that you first land at one of two landmarks, but they're not named locations on the map, so you'd be forgiven for not knowing where these are. This can be either Groovy Grove [1] or Fungi Farm [2], but just be sure you land there, as simply walking to the location after landing elsewhere won't trigger completion of the first part of the quest.\"},{\"isTitle\":false,\"pos\":4,\"text\":\"Landing at Groovy Grove technically puts you closer, but the rotation isn't quite as straightforward, whereas Fungi Farm may be a little further away, but you'll have quicker and easier access to roads. Regardless of where you land, though, prepare to jog your way over there or grab the nearest car and take a drive unless you're lucky enough to stumble upon a rift to make things easy. You could also climb to the top of the Reality Tree and jump off a bouncy mushroom to redeploy with your parachute and cover a lot of ground quickly.\"},{\"isTitle\":false,\"pos\":5,\"text\":\"Once you've landed at Groovy Grove or Fungi Farm, you'll now have to make your way to Loot Lake to find The Glow [3], which is just west of Coney Crossroads. When you arrive, examine the southeastern segment of the lake to find the Fortnite Zero Point. Swim out toward it a bit and you'll complete the quest and earn your XP.\"}],\"full_text\":\"where to find the glow, groovy grove, and fungi farm locations in fortnite.  if you've just booted up fortnite for the first time this week, you may notice there is a fresh set of challenges for you to complete. if you want to maximize your xp gain, you'll want to knock all of them out, including a somewhat vaguely explained one that asks you to land at groovy grove or fungi farm and travel to the glow in a single match. if you're left wondering exactly how to wrap up this challenge, we've got you covered below, including an easily marked map location for the glow, as well as both starting points. where is the glow in fortnite this week 12 challenge requests that you first land at one of two landmarks, but they're not named locations on the map, so you'd be forgiven for not knowing where these are. this can be either groovy grove [1] or fungi farm [2], but just be sure you land there, as simply walking to the location after landing elsewhere won't trigger completion of the first part of the quest. landing at groovy grove technically puts you closer, but the rotation isn't quite as straightforward, whereas fungi farm may be a little further away, but you'll have quicker and easier access to roads. regardless of where you land, though, prepare to jog your way over there or grab the nearest car and take a drive unless you're lucky enough to stumble upon a rift to make things easy. you could also climb to the top of the reality tree and jump off a bouncy mushroom to redeploy with your parachute and cover a lot of ground quickly. once you've landed at groovy grove or fungi farm, you'll now have to make your way to loot lake to find the glow [3], which is just west of coney crossroads. when you arrive, examine the southeastern segment of the lake to find the fortnite zero point. swim out toward it a bit and you'll complete the quest and earn your xp.\",\"sentenses\":[\"where to find the glow, groovy grove, and fungi farm locations in fortnite.\",\"if you've just booted up fortnite for the first time this week, you may notice there is a fresh set of challenges for you to complete.\",\"if you want to maximize your xp gain, you'll want to knock all of them out, including a somewhat vaguely explained one that asks you to land at groovy grove or fungi farm and travel to the glow in a single match.\",\"if you're left wondering exactly how to wrap up this challenge, we've got you covered below, including an easily marked map location for the glow, as well as both starting points.\",\"where is the glow in fortnite this week 12 challenge requests that you first land at one of two landmarks, but they're not named locations on the map, so you'd be forgiven for not knowing where these are.\",\"this can be either groovy grove [1] or fungi farm [2], but just be sure you land there, as simply walking to the location after landing elsewhere won't trigger completion of the first part of the quest.\",\"landing at groovy grove technically puts you closer, but the rotation isn't quite as straightforward, whereas fungi farm may be a little further away, but you'll have quicker and easier access to roads.\",\"regardless of where you land, though, prepare to jog your way over there or grab the nearest car and take a drive unless you're lucky enough to stumble upon a rift to make things easy.\",\"you could also climb to the top of the reality tree and jump off a bouncy mushroom to redeploy with your parachute and cover a lot of ground quickly.\",\"once you've landed at groovy grove or fungi farm, you'll now have to make your way to loot lake to find the glow [3], which is just west of coney crossroads.\",\"when you arrive, examine the southeastern segment of the lake to find the fortnite zero point.\",\"swim out toward it a bit and you'll complete the quest and earn your xp.\"],\"tokenized_text\":[\"[where, to, find, the, glow, ,, groovy, grove, ,, and, fungi, farm, locations, in, fortnite, .]\",\"[if, you, 've, just, booted, up, fortnite, for, the, first, time, this, week, ,, you, may, notice, there, is, a, fresh, set, of, challenges, for, you, to, complete, .]\",\"[if, you, want, to, maximize, your, xp, gain, ,, you, 'll, want, to, knock, all, of, them, out, ,, including, a, somewhat, vaguely, explained, one, that, asks, you, to, land, at, groovy, grove, or, fungi, farm, and, travel, to, the, glow, in, a, single, match, .]\",\"[if, you, 're, left, wondering, exactly, how, to, wrap, up, this, challenge, ,, we, 've, got, you, covered, below, ,, including, an, easily, marked, map, location, for, the, glow, ,, as, well, as, both, starting, points, .]\",\"[where, is, the, glow, in, fortnite, this, week, 12, challenge, requests, that, you, first, land, at, one, of, two, landmarks, ,, but, they, 're, not, named, locations, on, the, map, ,, so, you, 'd, be, forgiven, for, not, knowing, where, these, are, .]\",\"[this, can, be, either, groovy, grove, [, 1, ], or, fungi, farm, [, 2, ], ,, but, just, be, sure, you, land, there, ,, as, simply, walking, to, the, location, after, landing, elsewhere, wo, n't, trigger, completion, of, the, first, part, of, the, quest, .]\",\"[landing, at, groovy, grove, technically, puts, you, closer, ,, but, the, rotation, is, n't, quite, as, straightforward, ,, whereas, fungi, farm, may, be, a, little, further, away, ,, but, you, 'll, have, quicker, and, easier, access, to, roads, .]\",\"[regardless, of, where, you, land, ,, though, ,, prepare, to, jog, your, way, over, there, or, grab, the, nearest, car, and, take, a, drive, unless, you, 're, lucky, enough, to, stumble, upon, a, rift, to, make, things, easy, .]\",\"[you, could, also, climb, to, the, top, of, the, reality, tree, and, jump, off, a, bouncy, mushroom, to, redeploy, with, your, parachute, and, cover, a, lot, of, ground, quickly, .]\",\"[once, you, 've, landed, at, groovy, grove, or, fungi, farm, ,, you, 'll, now, have, to, make, your, way, to, loot, lake, to, find, the, glow, [, 3, ], ,, which, is, just, west, of, coney, crossroads, .]\",\"[when, you, arrive, ,, examine, the, southeastern, segment, of, the, lake, to, find, the, fortnite, zero, point, .]\",\"[swim, out, toward, it, a, bit, and, you, 'll, complete, the, quest, and, earn, your, xp, .]\"],\"BIO\":[[[\"once\",\"O\"],[\"you\",\"O\"],[\"'ve\",\"O\"],[\"landed\",\"O\"],[\"at\",\"O\"],[\"groovy\",\"O\"],[\"grove\",\"O\"],[\"or\",\"O\"],[\"fungi\",\"O\"],[\"farm\",\"O\"],[\",\",\"O\"],[\"you\",\"O\"],[\"'ll\",\"O\"],[\"now\",\"O\"],[\"have\",\"O\"],[\"to\",\"O\"],[\"make\",\"O\"],[\"your\",\"O\"],[\"way\",\"O\"],[\"to\",\"O\"],[\"loot\",\"O\"],[\"lake\",\"B-game\"],[\"to\",\"O\"],[\"find\",\"O\"],[\"the\",\"O\"],[\"glow\",\"O\"],[\"[\",\"O\"],[\"3\",\"O\"],[\"]\",\"O\"],[\",\",\"O\"],[\"which\",\"O\"],[\"is\",\"O\"],[\"just\",\"O\"],[\"west\",\"O\"],[\"of\",\"O\"],[\"coney\",\"O\"],[\"crossroads\",\"O\"],[\".\",\"O\"]],[[\"when\",\"O\"],[\"you\",\"O\"],[\"arrive\",\"O\"],[\",\",\"O\"],[\"examine\",\"O\"],[\"the\",\"O\"],[\"southeastern\",\"O\"],[\"segment\",\"O\"],[\"of\",\"O\"],[\"the\",\"O\"],[\"lake\",\"B-game\"],[\"to\",\"O\"],[\"find\",\"O\"],[\"the\",\"O\"],[\"fortnite\",\"O\"],[\"zero\",\"O\"],[\"point\",\"O\"],[\".\",\"O\"]]]}", "{\"_id\":23,\"title\":\"Battlefield 2042 Season 2: Master Of Arms Release Date, New Map, More Weapons Revealed\",\"text\":[{\"isTitle\":false,\"pos\":0,\"text\":\"EA and DICE have announced the first details on Battlefield 2042 Season 2. The sophomore season is called Master of Arms, and it's set for release on August 30 on all platforms.\"},{\"isTitle\":false,\"pos\":1,\"text\":\"The new season adds a new map set in the Panama Canal called Stranded, as well as a new Specialist character, more weapons and gear, and a new battle pass with 100 tiers of content.\"},{\"isTitle\":false,\"pos\":3,\"text\":\"The new map, Stranded, sees players fighting in a drained lake near a shipwrecked tanker called the Starg Ceres. Players will fight for control of the ship, and can go inside it for close-quarters combat.\"},{\"isTitle\":false,\"pos\":4,\"text\":\"As for the new Specialist, Charlie Crawford joins Battlefield 2042 in Season 2. He's a healer and support character who can revive players and refill their gadgets. He can also use the Mounted Vulcan minigun.\"},{\"isTitle\":false,\"pos\":5,\"text\":\"Speaking of new stuff, Battlefield 2042's new season add the AM40 carbine, which bills itself as a \\\"midpoint\\\" between an assault rifle and a submachine gun. Another new gun is the Avancys, which is a light machine gun. The PF41 is a mix between an SMG and a pistol, meanwhile, while another new item is the concussion grenade which temporarily confuses enemies.\"},{\"isTitle\":false,\"pos\":7,\"text\":\"Battlefield 2042's Season 2 also introduces the EBLC-RAM, a four-seat vehicle that also serves as a spawn point if players place a beacon on it. Another new vehicle is the Polaris RZR, which is a lightweight buggy.\"},{\"isTitle\":false,\"pos\":8,\"text\":\"Additionally, Battlefield 2042 introduces a new feature called Assignments, which are progression tracks that allow players to unlock more weapons that were previously available only in Battlefield Portal. The M60E3 and M16A3 are the first two, with more to come in the future. Players can use the Assignments feature to unlock content from Season 1 as well, including vehicles, weapons, and a Specialist character.\"},{\"isTitle\":false,\"pos\":9,\"text\":\"As for Battlefield Portal, the mode gets new features in Season 2, including the ability to scale down battlefields for more frenetic action. Additionally, five weapons from Battlefield 3, Bad Company 2, and Battlefield 1942 are being added to Portal in Season 2.\"},{\"isTitle\":false,\"pos\":11,\"text\":\"Battlefield 2042 didn't have the smoothest launch, but it was the fifth best-selling game overall in the US for 2021. EA and DICE are said to be learning from the struggles and apply those lessons to the next Battlefield game, which is reportedly now in development.\"},{\"isTitle\":false,\"pos\":12,\"text\":\"Beyond that, EA is creating a Battlefield connected universe, and this will also include a narrative-focused game from Master Chief designer Marcus Lehto's new studio.\"}],\"full_text\":\"battlefield 2042 season 2: master of arms release date, new map, more weapons revealed.  ea and dice have announced the first details on battlefield 2042 season 2. the sophomore season is called master of arms, and it's set for release on august 30 on all platforms. the new season adds a new map set in the panama canal called stranded, as well as a new specialist character, more weapons and gear, and a new battle pass with 100 tiers of content. the new map, stranded, sees players fighting in a drained lake near a shipwrecked tanker called the starg ceres. players will fight for control of the ship, and can go inside it for close-quarters combat. as for the new specialist, charlie crawford joins battlefield 2042 in season 2. he's a healer and support character who can revive players and refill their gadgets. he can also use the mounted vulcan minigun. speaking of new stuff, battlefield 2042's new season add the am40 carbine, which bills itself as a \\\"midpoint\\\" between an assault rifle and a submachine gun. another new gun is the avancys, which is a light machine gun. the pf41 is a mix between an smg and a pistol, meanwhile, while another new item is the concussion grenade which temporarily confuses enemies. battlefield 2042's season 2 also introduces the eblc-ram, a four-seat vehicle that also serves as a spawn point if players place a beacon on it. another new vehicle is the polaris rzr, which is a lightweight buggy. additionally, battlefield 2042 introduces a new feature called assignments, which are progression tracks that allow players to unlock more weapons that were previously available only in battlefield portal. the m60e3 and m16a3 are the first two, with more to come in the future. players can use the assignments feature to unlock content from season 1 as well, including vehicles, weapons, and a specialist character. as for battlefield portal, the mode gets new features in season 2, including the ability to scale down battlefields for more frenetic action. additionally, five weapons from battlefield 3, bad company 2, and battlefield 1942 are being added to portal in season 2. battlefield 2042 didn't have the smoothest launch, but it was the fifth best-selling game overall in the us for 2021. ea and dice are said to be learning from the struggles and apply those lessons to the next battlefield game, which is reportedly now in development. beyond that, ea is creating a battlefield connected universe, and this will also include a narrative-focused game from master chief designer marcus lehto's new studio.\",\"sentenses\":[\"battlefield 2042 season 2: master of arms release date, new map, more weapons revealed.\",\"ea and dice have announced the first details on battlefield 2042 season 2. the sophomore season is called master of arms, and it's set for release on august 30 on all platforms.\",\"the new season adds a new map set in the panama canal called stranded, as well as a new specialist character, more weapons and gear, and a new battle pass with 100 tiers of content.\",\"the new map, stranded, sees players fighting in a drained lake near a shipwrecked tanker called the starg ceres.\",\"players will fight for control of the ship, and can go inside it for close-quarters combat.\",\"as for the new specialist, charlie crawford joins battlefield 2042 in season 2. he's a healer and support character who can revive players and refill their gadgets.\",\"he can also use the mounted vulcan minigun.\",\"speaking of new stuff, battlefield 2042's new season add the am40 carbine, which bills itself as a \\\"midpoint\\\" between an assault rifle and a submachine gun.\",\"another new gun is the avancys, which is a light machine gun.\",\"the pf41 is a mix between an smg and a pistol, meanwhile, while another new item is the concussion grenade which temporarily confuses enemies.\",\"battlefield 2042's season 2 also introduces the eblc-ram, a four-seat vehicle that also serves as a spawn point if players place a beacon on it.\",\"another new vehicle is the polaris rzr, which is a lightweight buggy.\",\"additionally, battlefield 2042 introduces a new feature called assignments, which are progression tracks that allow players to unlock more weapons that were previously available only in battlefield portal.\",\"the m60e3 and m16a3 are the first two, with more to come in the future.\",\"players can use the assignments feature to unlock content from season 1 as well, including vehicles, weapons, and a specialist character.\",\"as for battlefield portal, the mode gets new features in season 2, including the ability to scale down battlefields for more frenetic action.\",\"additionally, five weapons from battlefield 3, bad company 2, and battlefield 1942 are being added to portal in season 2. battlefield 2042 didn't have the smoothest launch, but it was the fifth best-selling game overall in the us for 2021. ea and dice are said to be learning from the struggles and apply those lessons to the next battlefield game, which is reportedly now in development.\",\"beyond that, ea is creating a battlefield connected universe, and this will also include a narrative-focused game from master chief designer marcus lehto's new studio.\"],\"tokenized_text\":[\"[battlefield, 2042, season, 2, :, master, of, arms, release, date, ,, new, map, ,, more, weapons, revealed, .]\",\"[ea, and, dice, have, announced, the, first, details, on, battlefield, 2042, season, 2., the, sophomore, season, is, called, master, of, arms, ,, and, it, 's, set, for, release, on, august, 30, on, all, platforms, .]\",\"[the, new, season, adds, a, new, map, set, in, the, panama, canal, called, stranded, ,, as, well, as, a, new, specialist, character, ,, more, weapons, and, gear, ,, and, a, new, battle, pass, with, 100, tiers, of, content, .]\",\"[the, new, map, ,, stranded, ,, sees, players, fighting, in, a, drained, lake, near, a, shipwrecked, tanker, called, the, starg, ceres, .]\",\"[players, will, fight, for, control, of, the, ship, ,, and, can, go, inside, it, for, close-quarters, combat, .]\",\"[as, for, the, new, specialist, ,, charlie, crawford, joins, battlefield, 2042, in, season, 2., he, 's, a, healer, and, support, character, who, can, revive, players, and, refill, their, gadgets, .]\",\"[he, can, also, use, the, mounted, vulcan, minigun, .]\",\"[speaking, of, new, stuff, ,, battlefield, 2042, 's, new, season, add, the, am40, carbine, ,, which, bills, itself, as, a, ``, midpoint, '', between, an, assault, rifle, and, a, submachine, gun, .]\",\"[another, new, gun, is, the, avancys, ,, which, is, a, light, machine, gun, .]\",\"[the, pf41, is, a, mix, between, an, smg, and, a, pistol, ,, meanwhile, ,, while, another, new, item, is, the, concussion, grenade, which, temporarily, confuses, enemies, .]\",\"[battlefield, 2042, 's, season, 2, also, introduces, the, eblc-ram, ,, a, four-seat, vehicle, that, also, serves, as, a, spawn, point, if, players, place, a, beacon, on, it, .]\",\"[another, new, vehicle, is, the, polaris, rzr, ,, which, is, a, lightweight, buggy, .]\",\"[additionally, ,, battlefield, 2042, introduces, a, new, feature, called, assignments, ,, which, are, progression, tracks, that, allow, players, to, unlock, more, weapons, that, were, previously, available, only, in, battlefield, portal, .]\",\"[the, m60e3, and, m16a3, are, the, first, two, ,, with, more, to, come, in, the, future, .]\",\"[players, can, use, the, assignments, feature, to, unlock, content, from, season, 1, as, well, ,, including, vehicles, ,, weapons, ,, and, a, specialist, character, .]\",\"[as, for, battlefield, portal, ,, the, mode, gets, new, features, in, season, 2, ,, including, the, ability, to, scale, down, battlefields, for, more, frenetic, action, .]\",\"[additionally, ,, five, weapons, from, battlefield, 3, ,, bad, company, 2, ,, and, battlefield, 1942, are, being, added, to, portal, in, season, 2., battlefield, 2042, did, n't, have, the, smoothest, launch, ,, but, it, was, the, fifth, best-selling, game, overall, in, the, us, for, 2021., ea, and, dice, are, said, to, be, learning, from, the, struggles, and, apply, those, lessons, to, the, next, battlefield, game, ,, which, is, reportedly, now, in, development, .]\",\"[beyond, that, ,, ea, is, creating, a, battlefield, connected, universe, ,, and, this, will, also, include, a, narrative-focused, game, from, master, chief, designer, marcus, lehto, 's, new, studio, .]\"],\"BIO\":[[[\"the\",\"O\"],[\"new\",\"O\"],[\"map\",\"O\"],[\",\",\"O\"],[\"stranded\",\"O\"],[\",\",\"O\"],[\"sees\",\"O\"],[\"players\",\"O\"],[\"fighting\",\"O\"],[\"in\",\"O\"],[\"a\",\"O\"],[\"drained\",\"O\"],[\"lake\",\"B-game\"],[\"near\",\"O\"],[\"a\",\"O\"],[\"shipwrecked\",\"O\"],[\"tanker\",\"O\"],[\"called\",\"O\"],[\"the\",\"O\"],[\"starg\",\"O\"],[\"ceres\",\"O\"],[\".\",\"O\"]]]}", "{\"_id\":24,\"title\":\"Destiny 2: Lightfall Release Date, Strand Subclass, And Everything We Know\",\"text\":[{\"isTitle\":false,\"pos\":0,\"text\":\"Destiny 2’s Year 6 expansion will bring a brand-new campaign, updated in-game features, another Darkness subclass, and both new enemies and allies. Destiny 2's Game Director Joe Blackburn said in the Destiny 2: Lightfall showcase that \\\"this is the beginning of the end\\\" of the Light and Darkness saga.\"},{\"isTitle\":true,\"pos\":1,\"text\":\"Release date\"},{\"isTitle\":false,\"pos\":2,\"text\":\"Destiny 2: Lightfall is set for release on February 28, 2023, for PC, Stadia, PS4, PS5, Xbox One, and Xbox Series X|S.\"},{\"isTitle\":true,\"pos\":3,\"text\":\"Destiny 2: Lightfall campaign\"},{\"isTitle\":false,\"pos\":4,\"text\":\"Destiny 2: Lightfall takes place in the neon cyberpunk city of Neomuna on planet Neptune where people who escaped the Collapse created a metropolis over the past centuries without the Last City knowing. The trailer during the Destiny 2 Lightfall showcase pictured Guardians fighting the new Dark Cabal force (known as the Shadow Legion) in the abandoned city as the threat of a second Collapse arrived. Season of the Haunted took players to the Leviathan ship to prevent Calus from becoming another Disciple of The Witness, and Guardians were unsuccessful.\"},{\"isTitle\":false,\"pos\":6,\"text\":\"Bungie introduced an elected difficulty in The Witch Queen expansion, and Lightfall will also have a Legendary campaign mode option for players looking for a challenging experience.\"},{\"isTitle\":true,\"pos\":7,\"text\":\"New friends and foes\"},{\"isTitle\":false,\"pos\":8,\"text\":\"The Lightfall trailer showed an enigmatic human character in Neomuna, who is part of the Cloud Striders. The Cloud Striders are volunteers stepping up to protect humanity, unlike guardians who were revived by the Traveler whether they wanted to or not.\"},{\"isTitle\":false,\"pos\":10,\"text\":\"These people aren’t like Suraya Hawthorne--a character introduced in the Red War story as a non-Guardian fighter. Instead, the Cloud Striders have cyber enhancements with the cost of reducing their cyborg life span to 10 years. Bungie said that this new set of heroes creates a juxtaposition of humanity fighting to save the Solar System with immortal and mortal abilities. On Bungie's Lightfall page, players can spot the familiar face of Osiris. It indicates that Osiris wakes up after going unconscious since Season of the Lost.\"},{\"isTitle\":false,\"pos\":12,\"text\":\"Players will fight the Shadow Legion of Disciple Calus on Neomuna. The Dark Cabal are meshed with Darkness and have new abilities. With Calus joining The Witness, this entity provided a brand-new type of enemy called the Tormentor. The Tormentors are part of the Pyramid unit that thematically matches the design of the Pyramid ship in Savathun’s Throne World. These giant enemies are like mini-bosses. They carry an enormous scythe and have unique abilities. Also, where there’s neon, there’s the Vex. Blackburn mentioned in the Lightfall post-show that there is a Vex threat, but didn’t specify what it is.\"},{\"isTitle\":true,\"pos\":13,\"text\":\"In-game features\"},{\"isTitle\":false,\"pos\":14,\"text\":\"Bungie stated new players are flooding into Destiny 2, but it wanted to implement something into the game that eases the player transition from New Light missions into the rest of the content. The developer is introducing Guardian Ranks, a knowledge ladder where players can progress through different ranks that guide them through the game.\"},{\"isTitle\":false,\"pos\":16,\"text\":\"Also, finding teammates in-game will be easier with the built-in LFG feature. At the end of PvE activities, players can give Commendations to others to indicate whether someone was a good leader, for example. Other features include in-game loadout builds and a mod manager. Players can update their builds on a single page and save loadouts with those custom builds.\"},{\"isTitle\":false,\"pos\":17,\"text\":\"Additionally, Bungie's tradition of sunsetting older content into the Destiny Content Vault is ending with Lightfall.\"},{\"isTitle\":true,\"pos\":18,\"text\":\"Strand subclass\"},{\"isTitle\":false,\"pos\":19,\"text\":\"Strand is the all-new neon green, Darkness subclass and is all about wielding psychic energy. Warlocks are the telekinetic Architects, Hunters have their rope dart as Threadrunners, and Titans are claw-bearing Tyrants.\"},{\"isTitle\":false,\"pos\":21,\"text\":\"Bungie also said that all three classes have a grappling hook to swing around or travel midair. In a brief introduction to Strand's Super abilities, Bungie showed Warlocks creating a barrage of missiles that unravels on impact and becomes explosive. Titans rapidly spin with claws for arms, slashing anyone that comes in the way. Lastly, Hunters run around throwing and spinning their rope dart at enemies.\"},{\"isTitle\":true,\"pos\":22,\"text\":\"Raid and dungeons\"},{\"isTitle\":false,\"pos\":23,\"text\":\"Lightfall will have a new raid that Bungie describes on its site: \\\"A haunting presence has been detected within [REDACTED]. Guardians must explore the mystery and discover everything they can about this threat.\\\" There will be a new dungeon in Season 21 and Season 23 with Exotic weapon rewards and more.\"},{\"isTitle\":true,\"pos\":24,\"text\":\"Preorder editions\"},{\"isTitle\":false,\"pos\":25,\"text\":\"Players can preorder the $50 standard edition of Lightfall to instantly unlock an emblem and Exotic Ghost shell. The standard edition has a new campaign, subclass, a new raid, exotic gear, and access to Season 20.\"},{\"isTitle\":false,\"pos\":26,\"text\":\"Preordering the $100 Annual Pass edition gives players in-game access to the Quicksilver Storm Exotic auto rifle and Exotic emote right now on top of the Exotic Ghost shell and an emblem. The Annual Pass has the same content as the Standard edition and: Season 20 through Season 23, Lightfall Dungeon Key, Quicksilver Storm catalyst and ornament, an Exotic Sparrow, and Master Rahool’s Secret Stash in the four seasons. Players can unlock this Stash once per season, which gives: two Ascendant Alloys, three Ascendant Shards, one Exotic Cipher, five Upgrade Modules, and one Exotic Cosmetic Item.\"},{\"isTitle\":false,\"pos\":28,\"text\":\"Lastly, the Collector’s Edition has two versions: one includes the Annual Pass game code for $250, and the other does not have a game code at all for $150. The Collector’s Edition has the Lightfall digital soundtrack, an 8\\\" Pouka Replica Figure with LED Lights and Stand (this is Elsie Bray’s fish introduced in the Beyond Light trailer), Vanguard lore books, a letter from Zavala, mini-lithograph, a vinyl sticker, and a Collector’s Edition emblem.\"},{\"isTitle\":false,\"pos\":29,\"text\":\"We'll update this page as we learn more information.\"}],\"full_text\":\"destiny 2: lightfall release date, strand subclass, and everything we know.  destiny 2’s year 6 expansion will bring a brand-new campaign, updated in-game features, another darkness subclass, and both new enemies and allies. destiny 2's game director joe blackburn said in the destiny 2: lightfall showcase that \\\"this is the beginning of the end\\\" of the light and darkness saga. release date destiny 2: lightfall is set for release on february 28, 2023, for pc, stadia, ps4, ps5, xbox one, and xbox series x|s. destiny 2: lightfall campaign destiny 2: lightfall takes place in the neon cyberpunk city of neomuna on planet neptune where people who escaped the collapse created a metropolis over the past centuries without the last city knowing. the trailer during the destiny 2 lightfall showcase pictured guardians fighting the new dark cabal force (known as the shadow legion) in the abandoned city as the threat of a second collapse arrived. season of the haunted took players to the leviathan ship to prevent calus from becoming another disciple of the witness, and guardians were unsuccessful. bungie introduced an elected difficulty in the witch queen expansion, and lightfall will also have a legendary campaign mode option for players looking for a challenging experience. new friends and foes the lightfall trailer showed an enigmatic human character in neomuna, who is part of the cloud striders. the cloud striders are volunteers stepping up to protect humanity, unlike guardians who were revived by the traveler whether they wanted to or not. these people aren’t like suraya hawthorne--a character introduced in the red war story as a non-guardian fighter. instead, the cloud striders have cyber enhancements with the cost of reducing their cyborg life span to 10 years. bungie said that this new set of heroes creates a juxtaposition of humanity fighting to save the solar system with immortal and mortal abilities. on bungie's lightfall page, players can spot the familiar face of osiris. it indicates that osiris wakes up after going unconscious since season of the lost. players will fight the shadow legion of disciple calus on neomuna. the dark cabal are meshed with darkness and have new abilities. with calus joining the witness, this entity provided a brand-new type of enemy called the tormentor. the tormentors are part of the pyramid unit that thematically matches the design of the pyramid ship in savathun’s throne world. these giant enemies are like mini-bosses. they carry an enormous scythe and have unique abilities. also, where there’s neon, there’s the vex. blackburn mentioned in the lightfall post-show that there is a vex threat, but didn’t specify what it is. in-game features bungie stated new players are flooding into destiny 2, but it wanted to implement something into the game that eases the player transition from new light missions into the rest of the content. the developer is introducing guardian ranks, a knowledge ladder where players can progress through different ranks that guide them through the game. also, finding teammates in-game will be easier with the built-in lfg feature. at the end of pve activities, players can give commendations to others to indicate whether someone was a good leader, for example. other features include in-game loadout builds and a mod manager. players can update their builds on a single page and save loadouts with those custom builds. additionally, bungie's tradition of sunsetting older content into the destiny content vault is ending with lightfall. strand subclass strand is the all-new neon green, darkness subclass and is all about wielding psychic energy. warlocks are the telekinetic architects, hunters have their rope dart as threadrunners, and titans are claw-bearing tyrants. bungie also said that all three classes have a grappling hook to swing around or travel midair. in a brief introduction to strand's super abilities, bungie showed warlocks creating a barrage of missiles that unravels on impact and becomes explosive. titans rapidly spin with claws for arms, slashing anyone that comes in the way. lastly, hunters run around throwing and spinning their rope dart at enemies. raid and dungeons lightfall will have a new raid that bungie describes on its site: \\\"a haunting presence has been detected within [redacted]. guardians must explore the mystery and discover everything they can about this threat.\\\" there will be a new dungeon in season 21 and season 23 with exotic weapon rewards and more. preorder editions players can preorder the $50 standard edition of lightfall to instantly unlock an emblem and exotic ghost shell. the standard edition has a new campaign, subclass, a new raid, exotic gear, and access to season 20. preordering the $100 annual pass edition gives players in-game access to the quicksilver storm exotic auto rifle and exotic emote right now on top of the exotic ghost shell and an emblem. the annual pass has the same content as the standard edition and: season 20 through season 23, lightfall dungeon key, quicksilver storm catalyst and ornament, an exotic sparrow, and master rahool’s secret stash in the four seasons. players can unlock this stash once per season, which gives: two ascendant alloys, three ascendant shards, one exotic cipher, five upgrade modules, and one exotic cosmetic item. lastly, the collector’s edition has two versions: one includes the annual pass game code for $250, and the other does not have a game code at all for $150. the collector’s edition has the lightfall digital soundtrack, an 8\\\" pouka replica figure with led lights and stand (this is elsie bray’s fish introduced in the beyond light trailer), vanguard lore books, a letter from zavala, mini-lithograph, a vinyl sticker, and a collector’s edition emblem. we'll update this page as we learn more information.\",\"sentenses\":[\"destiny 2: lightfall release date, strand subclass, and everything we know.\",\"destiny 2’s year 6 expansion will bring a brand-new campaign, updated in-game features, another darkness subclass, and both new enemies and allies.\",\"destiny 2's game director joe blackburn said in the destiny 2: lightfall showcase that \\\"this is the beginning of the end\\\" of the light and darkness saga.\",\"release date destiny 2: lightfall is set for release on february 28, 2023, for pc, stadia, ps4, ps5, xbox one, and xbox series x|s.\",\"destiny 2: lightfall campaign destiny 2: lightfall takes place in the neon cyberpunk city of neomuna on planet neptune where people who escaped the collapse created a metropolis over the past centuries without the last city knowing.\",\"the trailer during the destiny 2 lightfall showcase pictured guardians fighting the new dark cabal force (known as the shadow legion) in the abandoned city as the threat of a second collapse arrived.\",\"season of the haunted took players to the leviathan ship to prevent calus from becoming another disciple of the witness, and guardians were unsuccessful.\",\"bungie introduced an elected difficulty in the witch queen expansion, and lightfall will also have a legendary campaign mode option for players looking for a challenging experience.\",\"new friends and foes the lightfall trailer showed an enigmatic human character in neomuna, who is part of the cloud striders.\",\"the cloud striders are volunteers stepping up to protect humanity, unlike guardians who were revived by the traveler whether they wanted to or not.\",\"these people aren’t like suraya hawthorne--a character introduced in the red war story as a non-guardian fighter.\",\"instead, the cloud striders have cyber enhancements with the cost of reducing their cyborg life span to 10 years.\",\"bungie said that this new set of heroes creates a juxtaposition of humanity fighting to save the solar system with immortal and mortal abilities.\",\"on bungie's lightfall page, players can spot the familiar face of osiris.\",\"it indicates that osiris wakes up after going unconscious since season of the lost.\",\"players will fight the shadow legion of disciple calus on neomuna.\",\"the dark cabal are meshed with darkness and have new abilities.\",\"with calus joining the witness, this entity provided a brand-new type of enemy called the tormentor.\",\"the tormentors are part of the pyramid unit that thematically matches the design of the pyramid ship in savathun’s throne world.\",\"these giant enemies are like mini-bosses.\",\"they carry an enormous scythe and have unique abilities.\",\"also, where there’s neon, there’s the vex.\",\"blackburn mentioned in the lightfall post-show that there is a vex threat, but didn’t specify what it is.\",\"in-game features bungie stated new players are flooding into destiny 2, but it wanted to implement something into the game that eases the player transition from new light missions into the rest of the content.\",\"the developer is introducing guardian ranks, a knowledge ladder where players can progress through different ranks that guide them through the game.\",\"also, finding teammates in-game will be easier with the built-in lfg feature.\",\"at the end of pve activities, players can give commendations to others to indicate whether someone was a good leader, for example.\",\"other features include in-game loadout builds and a mod manager.\",\"players can update their builds on a single page and save loadouts with those custom builds.\",\"additionally, bungie's tradition of sunsetting older content into the destiny content vault is ending with lightfall.\",\"strand subclass strand is the all-new neon green, darkness subclass and is all about wielding psychic energy.\",\"warlocks are the telekinetic architects, hunters have their rope dart as threadrunners, and titans are claw-bearing tyrants.\",\"bungie also said that all three classes have a grappling hook to swing around or travel midair.\",\"in a brief introduction to strand's super abilities, bungie showed warlocks creating a barrage of missiles that unravels on impact and becomes explosive.\",\"titans rapidly spin with claws for arms, slashing anyone that comes in the way.\",\"lastly, hunters run around throwing and spinning their rope dart at enemies.\",\"raid and dungeons lightfall will have a new raid that bungie describes on its site: \\\"a haunting presence has been detected within [redacted].\",\"guardians must explore the mystery and discover everything they can about this threat.\\\"\",\"there will be a new dungeon in season 21 and season 23 with exotic weapon rewards and more.\",\"preorder editions players can preorder the $50 standard edition of lightfall to instantly unlock an emblem and exotic ghost shell.\",\"the standard edition has a new campaign, subclass, a new raid, exotic gear, and access to season 20. preordering the $100 annual pass edition gives players in-game access to the quicksilver storm exotic auto rifle and exotic emote right now on top of the exotic ghost shell and an emblem.\",\"the annual pass has the same content as the standard edition and: season 20 through season 23, lightfall dungeon key, quicksilver storm catalyst and ornament, an exotic sparrow, and master rahool’s secret stash in the four seasons.\",\"players can unlock this stash once per season, which gives: two ascendant alloys, three ascendant shards, one exotic cipher, five upgrade modules, and one exotic cosmetic item.\",\"lastly, the collector’s edition has two versions: one includes the annual pass game code for $250, and the other does not have a game code at all for $150.\",\"the collector’s edition has the lightfall digital soundtrack, an 8\\\" pouka replica figure with led lights and stand (this is elsie bray’s fish introduced in the beyond light trailer), vanguard lore books, a letter from zavala, mini-lithograph, a vinyl sticker, and a collector’s edition emblem.\",\"we'll update this page as we learn more information.\"],\"tokenized_text\":[\"[destiny, 2, :, lightfall, release, date, ,, strand, subclass, ,, and, everything, we, know, .]\",\"[destiny, 2, ’, s, year, 6, expansion, will, bring, a, brand-new, campaign, ,, updated, in-game, features, ,, another, darkness, subclass, ,, and, both, new, enemies, and, allies, .]\",\"[destiny, 2, 's, game, director, joe, blackburn, said, in, the, destiny, 2, :, lightfall, showcase, that, ``, this, is, the, beginning, of, the, end, '', of, the, light, and, darkness, saga, .]\",\"[release, date, destiny, 2, :, lightfall, is, set, for, release, on, february, 28, ,, 2023, ,, for, pc, ,, stadia, ,, ps4, ,, ps5, ,, xbox, one, ,, and, xbox, series, x|s, .]\",\"[destiny, 2, :, lightfall, campaign, destiny, 2, :, lightfall, takes, place, in, the, neon, cyberpunk, city, of, neomuna, on, planet, neptune, where, people, who, escaped, the, collapse, created, a, metropolis, over, the, past, centuries, without, the, last, city, knowing, .]\",\"[the, trailer, during, the, destiny, 2, lightfall, showcase, pictured, guardians, fighting, the, new, dark, cabal, force, (, known, as, the, shadow, legion, ), in, the, abandoned, city, as, the, threat, of, a, second, collapse, arrived, .]\",\"[season, of, the, haunted, took, players, to, the, leviathan, ship, to, prevent, calus, from, becoming, another, disciple, of, the, witness, ,, and, guardians, were, unsuccessful, .]\",\"[bungie, introduced, an, elected, difficulty, in, the, witch, queen, expansion, ,, and, lightfall, will, also, have, a, legendary, campaign, mode, option, for, players, looking, for, a, challenging, experience, .]\",\"[new, friends, and, foes, the, lightfall, trailer, showed, an, enigmatic, human, character, in, neomuna, ,, who, is, part, of, the, cloud, striders, .]\",\"[the, cloud, striders, are, volunteers, stepping, up, to, protect, humanity, ,, unlike, guardians, who, were, revived, by, the, traveler, whether, they, wanted, to, or, not, .]\",\"[these, people, aren, ’, t, like, suraya, hawthorne, --, a, character, introduced, in, the, red, war, story, as, a, non-guardian, fighter, .]\",\"[instead, ,, the, cloud, striders, have, cyber, enhancements, with, the, cost, of, reducing, their, cyborg, life, span, to, 10, years, .]\",\"[bungie, said, that, this, new, set, of, heroes, creates, a, juxtaposition, of, humanity, fighting, to, save, the, solar, system, with, immortal, and, mortal, abilities, .]\",\"[on, bungie, 's, lightfall, page, ,, players, can, spot, the, familiar, face, of, osiris, .]\",\"[it, indicates, that, osiris, wakes, up, after, going, unconscious, since, season, of, the, lost, .]\",\"[players, will, fight, the, shadow, legion, of, disciple, calus, on, neomuna, .]\",\"[the, dark, cabal, are, meshed, with, darkness, and, have, new, abilities, .]\",\"[with, calus, joining, the, witness, ,, this, entity, provided, a, brand-new, type, of, enemy, called, the, tormentor, .]\",\"[the, tormentors, are, part, of, the, pyramid, unit, that, thematically, matches, the, design, of, the, pyramid, ship, in, savathun, ’, s, throne, world, .]\",\"[these, giant, enemies, are, like, mini-bosses, .]\",\"[they, carry, an, enormous, scythe, and, have, unique, abilities, .]\",\"[also, ,, where, there, ’, s, neon, ,, there, ’, s, the, vex, .]\",\"[blackburn, mentioned, in, the, lightfall, post-show, that, there, is, a, vex, threat, ,, but, didn, ’, t, specify, what, it, is, .]\",\"[in-game, features, bungie, stated, new, players, are, flooding, into, destiny, 2, ,, but, it, wanted, to, implement, something, into, the, game, that, eases, the, player, transition, from, new, light, missions, into, the, rest, of, the, content, .]\",\"[the, developer, is, introducing, guardian, ranks, ,, a, knowledge, ladder, where, players, can, progress, through, different, ranks, that, guide, them, through, the, game, .]\",\"[also, ,, finding, teammates, in-game, will, be, easier, with, the, built-in, lfg, feature, .]\",\"[at, the, end, of, pve, activities, ,, players, can, give, commendations, to, others, to, indicate, whether, someone, was, a, good, leader, ,, for, example, .]\",\"[other, features, include, in-game, loadout, builds, and, a, mod, manager, .]\",\"[players, can, update, their, builds, on, a, single, page, and, save, loadouts, with, those, custom, builds, .]\",\"[additionally, ,, bungie, 's, tradition, of, sunsetting, older, content, into, the, destiny, content, vault, is, ending, with, lightfall, .]\",\"[strand, subclass, strand, is, the, all-new, neon, green, ,, darkness, subclass, and, is, all, about, wielding, psychic, energy, .]\",\"[warlocks, are, the, telekinetic, architects, ,, hunters, have, their, rope, dart, as, threadrunners, ,, and, titans, are, claw-bearing, tyrants, .]\",\"[bungie, also, said, that, all, three, classes, have, a, grappling, hook, to, swing, around, or, travel, midair, .]\",\"[in, a, brief, introduction, to, strand, 's, super, abilities, ,, bungie, showed, warlocks, creating, a, barrage, of, missiles, that, unravels, on, impact, and, becomes, explosive, .]\",\"[titans, rapidly, spin, with, claws, for, arms, ,, slashing, anyone, that, comes, in, the, way, .]\",\"[lastly, ,, hunters, run, around, throwing, and, spinning, their, rope, dart, at, enemies, .]\",\"[raid, and, dungeons, lightfall, will, have, a, new, raid, that, bungie, describes, on, its, site, :, ``, a, haunting, presence, has, been, detected, within, [, redacted, ], .]\",\"[guardians, must, explore, the, mystery, and, discover, everything, they, can, about, this, threat, ., '']\",\"[there, will, be, a, new, dungeon, in, season, 21, and, season, 23, with, exotic, weapon, rewards, and, more, .]\",\"[preorder, editions, players, can, preorder, the, $, 50, standard, edition, of, lightfall, to, instantly, unlock, an, emblem, and, exotic, ghost, shell, .]\",\"[the, standard, edition, has, a, new, campaign, ,, subclass, ,, a, new, raid, ,, exotic, gear, ,, and, access, to, season, 20., preordering, the, $, 100, annual, pass, edition, gives, players, in-game, access, to, the, quicksilver, storm, exotic, auto, rifle, and, exotic, emote, right, now, on, top, of, the, exotic, ghost, shell, and, an, emblem, .]\",\"[the, annual, pass, has, the, same, content, as, the, standard, edition, and, :, season, 20, through, season, 23, ,, lightfall, dungeon, key, ,, quicksilver, storm, catalyst, and, ornament, ,, an, exotic, sparrow, ,, and, master, rahool, ’, s, secret, stash, in, the, four, seasons, .]\",\"[players, can, unlock, this, stash, once, per, season, ,, which, gives, :, two, ascendant, alloys, ,, three, ascendant, shards, ,, one, exotic, cipher, ,, five, upgrade, modules, ,, and, one, exotic, cosmetic, item, .]\",\"[lastly, ,, the, collector, ’, s, edition, has, two, versions, :, one, includes, the, annual, pass, game, code, for, $, 250, ,, and, the, other, does, not, have, a, game, code, at, all, for, $, 150, .]\",\"[the, collector, ’, s, edition, has, the, lightfall, digital, soundtrack, ,, an, 8, '', pouka, replica, figure, with, led, lights, and, stand, (, this, is, elsie, bray, ’, s, fish, introduced, in, the, beyond, light, trailer, ), ,, vanguard, lore, books, ,, a, letter, from, zavala, ,, mini-lithograph, ,, a, vinyl, sticker, ,, and, a, collector, ’, s, edition, emblem, .]\",\"[we, 'll, update, this, page, as, we, learn, more, information, .]\"],\"BIO\":[[[\"destiny\",\"B-game\"],[\"2\",\"I-game\"],[\":\",\"I-game\"],[\"lightfall\",\"I-game\"],[\"release\",\"O\"],[\"date\",\"O\"],[\",\",\"O\"],[\"strand\",\"O\"],[\"subclass\",\"O\"],[\",\",\"O\"],[\"and\",\"O\"],[\"everything\",\"O\"],[\"we\",\"O\"],[\"know\",\"O\"],[\".\",\"O\"]],[[\"destiny\",\"O\"],[\"2\",\"O\"],[\"'s\",\"O\"],[\"game\",\"O\"],[\"director\",\"O\"],[\"joe\",\"O\"],[\"blackburn\",\"O\"],[\"said\",\"O\"],[\"in\",\"O\"],[\"the\",\"O\"],[\"destiny\",\"B-game\"],[\"2\",\"I-game\"],[\":\",\"I-game\"],[\"lightfall\",\"I-game\"],[\"showcase\",\"O\"],[\"that\",\"O\"],[\"``\",\"O\"],[\"this\",\"O\"],[\"is\",\"O\"],[\"the\",\"O\"],[\"beginning\",\"O\"],[\"of\",\"O\"],[\"the\",\"O\"],[\"end\",\"O\"],[\"''\",\"O\"],[\"of\",\"O\"],[\"the\",\"O\"],[\"light\",\"O\"],[\"and\",\"O\"],[\"darkness\",\"O\"],[\"saga\",\"O\"],[\".\",\"O\"]],[[\"release\",\"O\"],[\"date\",\"O\"],[\"destiny\",\"B-game\"],[\"2\",\"I-game\"],[\":\",\"I-game\"],[\"lightfall\",\"I-game\"],[\"is\",\"O\"],[\"set\",\"O\"],[\"for\",\"O\"],[\"release\",\"O\"],[\"on\",\"O\"],[\"february\",\"O\"],[\"28\",\"O\"],[\",\",\"O\"],[\"2023\",\"O\"],[\",\",\"O\"],[\"for\",\"O\"],[\"pc\",\"O\"],[\",\",\"O\"],[\"stadia\",\"O\"],[\",\",\"O\"],[\"ps4\",\"B-game\"],[\",\",\"I-game\"],[\"ps5\",\"I-game\"],[\",\",\"O\"],[\"xbox\",\"O\"],[\"one\",\"O\"],[\",\",\"O\"],[\"and\",\"O\"],[\"xbox\",\"O\"],[\"series\",\"O\"],[\"x|s\",\"O\"],[\".\",\"O\"]],[[\"destiny\",\"B-game\"],[\"2\",\"I-game\"],[\":\",\"I-game\"],[\"lightfall\",\"I-game\"],[\"campaign\",\"O\"],[\"destiny\",\"B-game\"],[\"2\",\"I-game\"],[\":\",\"I-game\"],[\"lightfall\",\"I-game\"],[\"takes\",\"O\"],[\"place\",\"O\"],[\"in\",\"O\"],[\"the\",\"O\"],[\"neon\",\"O\"],[\"cyberpunk\",\"O\"],[\"city\",\"O\"],[\"of\",\"O\"],[\"neomuna\",\"O\"],[\"on\",\"O\"],[\"planet\",\"O\"],[\"neptune\",\"O\"],[\"where\",\"O\"],[\"people\",\"O\"],[\"who\",\"O\"],[\"escaped\",\"O\"],[\"the\",\"O\"],[\"collapse\",\"O\"],[\"created\",\"O\"],[\"a\",\"O\"],[\"metropolis\",\"O\"],[\"over\",\"O\"],[\"the\",\"O\"],[\"past\",\"O\"],[\"centuries\",\"O\"],[\"without\",\"O\"],[\"the\",\"O\"],[\"last\",\"O\"],[\"city\",\"O\"],[\"knowing\",\"O\"],[\".\",\"O\"]],[[\"the\",\"O\"],[\"cloud\",\"O\"],[\"striders\",\"O\"],[\"are\",\"O\"],[\"volunteers\",\"O\"],[\"stepping\",\"O\"],[\"up\",\"O\"],[\"to\",\"O\"],[\"protect\",\"O\"],[\"humanity\",\"B-game\"],[\",\",\"O\"],[\"unlike\",\"O\"],[\"guardians\",\"O\"],[\"who\",\"O\"],[\"were\",\"O\"],[\"revived\",\"O\"],[\"by\",\"O\"],[\"the\",\"O\"],[\"traveler\",\"O\"],[\"whether\",\"O\"],[\"they\",\"O\"],[\"wanted\",\"O\"],[\"to\",\"O\"],[\"or\",\"O\"],[\"not\",\"O\"],[\".\",\"O\"]],[[\"bungie\",\"O\"],[\"said\",\"O\"],[\"that\",\"O\"],[\"this\",\"O\"],[\"new\",\"O\"],[\"set\",\"O\"],[\"of\",\"O\"],[\"heroes\",\"O\"],[\"creates\",\"O\"],[\"a\",\"O\"],[\"juxtaposition\",\"O\"],[\"of\",\"O\"],[\"humanity\",\"B-game\"],[\"fighting\",\"O\"],[\"to\",\"O\"],[\"save\",\"O\"],[\"the\",\"O\"],[\"solar\",\"O\"],[\"system\",\"O\"],[\"with\",\"O\"],[\"immortal\",\"O\"],[\"and\",\"O\"],[\"mortal\",\"O\"],[\"abilities\",\"O\"],[\".\",\"O\"]]]}", "{\"_id\":26,\"title\":\"How To Get The Quicksilver Storm Exotic In Destiny 2\",\"text\":[{\"isTitle\":false,\"pos\":0,\"text\":\"Season of Plunder has added several new Exotics to Destiny 2, but out of all of them, Quicksilver Storm stands apart as a fascinating glimpse of what's to come in 2023's Lightfall expansion. Featuring a design that's unlike anything seen in Destiny 2 so far, the Exotic auto rifle packs a punch with rock-solid specs, perks, and an explosive finisher that makes it a handy all-rounder.\"},{\"isTitle\":true,\"pos\":1,\"text\":\"How to get Quicksilver Storm\"},{\"isTitle\":false,\"pos\":3,\"text\":\"The short answer is that you're going to have to pay for Quicksilver. With Lightfall scheduled to launch on February 28 next year, Bungie is currently offering Quicksilver as a preorder bonus for anyone who purchases the Lightfall and Annual Pass combo. That's a $100 ticket to the future of Destiny 2, and also includes a few other bonuses that you'll be able to add to your collection, such as a cool banner, Exocitc Ghost shell, and an Exotic Strand emote. When Lightfall starts, you'll also be rewarded with extra Upgrade Modules, Ascendant Alloys, and other materials.\"},{\"isTitle\":false,\"pos\":4,\"text\":\"Once you have Lightfall preordered, you can pick up Quicksilver Storm from Master Rahool in the Tower. Head to the social space, interact with Rahool, and you can grab Quicksilver Storm from him through his vendor page. If you have any engrams waiting to be decrypted, just press B / Circle to skip past that page.\"},{\"isTitle\":true,\"pos\":5,\"text\":\"Quicksilver Storm unique perks\"},{\"isTitle\":false,\"pos\":6,\"text\":\"As a kinetic auto rifle, Quicksilver Storm hits a sweet spot for mid-range combat and can shred through enemies with a 50-round magazine. It has a vertical recoil and a moderate spread when firing from the hip, making it great for landing precision shots on weaker enemies. What makes it special are its two unique perks Rocket Tracers and Grenade Chaser. Rocket Tracers allows for a very quick homing mini-missile to automatically fire from the gun after you land around 10 successive hits on an enemy, and landing multiple missiles will generate a grenade that's stored inside of the gun.\"},{\"isTitle\":false,\"pos\":7,\"text\":\"You can stow Quicksilver Storm away and switch to another weapon without having to worry about losing the stored grenades. If you fall in battle though, you'll need to generate new grenades from scratch. You can save up to three explosives and turn Quicksilver Storm into a pump-action grenade launcher by holding down the reload button. Each grenade automatically explodes when in proximity to an enemy, and does a reasonable amount of damage.\"},{\"isTitle\":false,\"pos\":8,\"text\":\"Rocket Tracers\"},{\"isTitle\":false,\"pos\":9,\"text\":\"Landing multiple hits turns your next shot into a homing micro-rocket.\"},{\"isTitle\":false,\"pos\":10,\"text\":\"Grenade Chaser\"},{\"isTitle\":false,\"pos\":11,\"text\":\"Landing multiple rockets loads a grenade.\"},{\"isTitle\":false,\"pos\":12,\"text\":\"Alternate weapon action\"},{\"isTitle\":false,\"pos\":13,\"text\":\"Switch to Grenade Launcher mode.\"},{\"isTitle\":true,\"pos\":14,\"text\":\"How to get the Quicksilver Storm catalyst\"},{\"isTitle\":false,\"pos\":15,\"text\":\"Quicksilver Storm doesn't have a Catalyst currently, but one is on the way. The catalyst (and an ornament) are both mentioned as being included in the Lightfall + Annual Pass bundle.\"},{\"isTitle\":true,\"pos\":16,\"text\":\"Quicksilver Storm effectiveness\"},{\"isTitle\":false,\"pos\":18,\"text\":\"In PvE, Quicksilver Storm can be a damage-dealing beast. For larger bosses and enemies with bullet-sponge health bars, sustained fire throws a hail of bullets and mini-missiles at them and quickly piles up the damage. While reloading is quick, being able to switch from an empty magazine to the grenade launcher mode once you have projectiles stored within it makes it even more valuable and ideal for clearing a room.\"},{\"isTitle\":false,\"pos\":19,\"text\":\"Titans will find this weapon particularly useful when paired with the Actium War Rig Exotic armor. That gear reloads auto rifles and machine guns automatically, and with Quicksilver Storm equipped, Titans can unleash a storm of bullets and homing missiles on enemies.\"},{\"isTitle\":false,\"pos\":20,\"text\":\"For players who regularly pursue high-level activities, Quicksilver Storm can also come in handy for Legend Lost Sectors and Nightfalls. The Seasonal Artifact, Skeleton Key, has a mod slot for auto rifles so that they can break through the defenses of Barrier Champions, making this Exotic useful in those situations. For PvP players, there are numerous factors to consider but the auto rifle is a fun weapon for competitive play when you start melting through shields and launch a mini-missile as a quick finisher. The grenade also does heavy damage to players, and can be a useful finisher in the right scenario.\"},{\"isTitle\":false,\"pos\":21,\"text\":\"Season of Plunder also has another great Exotic weapon that you can unlock, Delicate Tomb, if a kinetic auto rifle doesn't fit into your current Guardian build plans.\"},{\"isTitle\":true,\"pos\":22,\"text\":\"Quicksilver Storm lore\"},{\"isTitle\":false,\"pos\":23,\"text\":\"The lore tab for Quicksilver Storm reveals that the weapon came into the possession of Elsie Bray AKA the Exo Stranger, who took it to the desolate moon of Ganymede that orbits Jupiter. Talking to her floating fish friend Tokki--the rifle identifies Tokki as a juvenile species of Pouka--Elsie comments that she has never seen a weapon like this in all of her travels across time and space. At this point in Destiny 2's story, the city of Neomuna is still hidden on Neptune and has managed to become a technologically advanced stronghold.\"},{\"isTitle\":false,\"pos\":24,\"text\":\"As Elsie mentions, Quicksilver Storm has nanite elements similar to the nanotechnology of SIVA, but far more advanced in its overall design. The overall impression of the weapon is that even when compared to the best of Golden Age technology, the design is lightyears ahead of what humanity was capable of at the time.\"}],\"full_text\":\"how to get the quicksilver storm exotic in destiny 2.  season of plunder has added several new exotics to destiny 2, but out of all of them, quicksilver storm stands apart as a fascinating glimpse of what's to come in 2023's lightfall expansion. featuring a design that's unlike anything seen in destiny 2 so far, the exotic auto rifle packs a punch with rock-solid specs, perks, and an explosive finisher that makes it a handy all-rounder. how to get quicksilver storm the short answer is that you're going to have to pay for quicksilver. with lightfall scheduled to launch on february 28 next year, bungie is currently offering quicksilver as a preorder bonus for anyone who purchases the lightfall and annual pass combo. that's a $100 ticket to the future of destiny 2, and also includes a few other bonuses that you'll be able to add to your collection, such as a cool banner, exocitc ghost shell, and an exotic strand emote. when lightfall starts, you'll also be rewarded with extra upgrade modules, ascendant alloys, and other materials. once you have lightfall preordered, you can pick up quicksilver storm from master rahool in the tower. head to the social space, interact with rahool, and you can grab quicksilver storm from him through his vendor page. if you have any engrams waiting to be decrypted, just press b / circle to skip past that page. quicksilver storm unique perks as a kinetic auto rifle, quicksilver storm hits a sweet spot for mid-range combat and can shred through enemies with a 50-round magazine. it has a vertical recoil and a moderate spread when firing from the hip, making it great for landing precision shots on weaker enemies. what makes it special are its two unique perks rocket tracers and grenade chaser. rocket tracers allows for a very quick homing mini-missile to automatically fire from the gun after you land around 10 successive hits on an enemy, and landing multiple missiles will generate a grenade that's stored inside of the gun. you can stow quicksilver storm away and switch to another weapon without having to worry about losing the stored grenades. if you fall in battle though, you'll need to generate new grenades from scratch. you can save up to three explosives and turn quicksilver storm into a pump-action grenade launcher by holding down the reload button. each grenade automatically explodes when in proximity to an enemy, and does a reasonable amount of damage. rocket tracers landing multiple hits turns your next shot into a homing micro-rocket. grenade chaser landing multiple rockets loads a grenade. alternate weapon action switch to grenade launcher mode. how to get the quicksilver storm catalyst quicksilver storm doesn't have a catalyst currently, but one is on the way. the catalyst (and an ornament) are both mentioned as being included in the lightfall + annual pass bundle. quicksilver storm effectiveness in pve, quicksilver storm can be a damage-dealing beast. for larger bosses and enemies with bullet-sponge health bars, sustained fire throws a hail of bullets and mini-missiles at them and quickly piles up the damage. while reloading is quick, being able to switch from an empty magazine to the grenade launcher mode once you have projectiles stored within it makes it even more valuable and ideal for clearing a room. titans will find this weapon particularly useful when paired with the actium war rig exotic armor. that gear reloads auto rifles and machine guns automatically, and with quicksilver storm equipped, titans can unleash a storm of bullets and homing missiles on enemies. for players who regularly pursue high-level activities, quicksilver storm can also come in handy for legend lost sectors and nightfalls. the seasonal artifact, skeleton key, has a mod slot for auto rifles so that they can break through the defenses of barrier champions, making this exotic useful in those situations. for pvp players, there are numerous factors to consider but the auto rifle is a fun weapon for competitive play when you start melting through shields and launch a mini-missile as a quick finisher. the grenade also does heavy damage to players, and can be a useful finisher in the right scenario. season of plunder also has another great exotic weapon that you can unlock, delicate tomb, if a kinetic auto rifle doesn't fit into your current guardian build plans. quicksilver storm lore the lore tab for quicksilver storm reveals that the weapon came into the possession of elsie bray aka the exo stranger, who took it to the desolate moon of ganymede that orbits jupiter. talking to her floating fish friend tokki--the rifle identifies tokki as a juvenile species of pouka--elsie comments that she has never seen a weapon like this in all of her travels across time and space. at this point in destiny 2's story, the city of neomuna is still hidden on neptune and has managed to become a technologically advanced stronghold. as elsie mentions, quicksilver storm has nanite elements similar to the nanotechnology of siva, but far more advanced in its overall design. the overall impression of the weapon is that even when compared to the best of golden age technology, the design is lightyears ahead of what humanity was capable of at the time.\",\"sentenses\":[\"how to get the quicksilver storm exotic in destiny 2.  season of plunder has added several new exotics to destiny 2, but out of all of them, quicksilver storm stands apart as a fascinating glimpse of what's to come in 2023's lightfall expansion.\",\"featuring a design that's unlike anything seen in destiny 2 so far, the exotic auto rifle packs a punch with rock-solid specs, perks, and an explosive finisher that makes it a handy all-rounder.\",\"how to get quicksilver storm the short answer is that you're going to have to pay for quicksilver.\",\"with lightfall scheduled to launch on february 28 next year, bungie is currently offering quicksilver as a preorder bonus for anyone who purchases the lightfall and annual pass combo.\",\"that's a $100 ticket to the future of destiny 2, and also includes a few other bonuses that you'll be able to add to your collection, such as a cool banner, exocitc ghost shell, and an exotic strand emote.\",\"when lightfall starts, you'll also be rewarded with extra upgrade modules, ascendant alloys, and other materials.\",\"once you have lightfall preordered, you can pick up quicksilver storm from master rahool in the tower.\",\"head to the social space, interact with rahool, and you can grab quicksilver storm from him through his vendor page.\",\"if you have any engrams waiting to be decrypted, just press b / circle to skip past that page.\",\"quicksilver storm unique perks as a kinetic auto rifle, quicksilver storm hits a sweet spot for mid-range combat and can shred through enemies with a 50-round magazine.\",\"it has a vertical recoil and a moderate spread when firing from the hip, making it great for landing precision shots on weaker enemies.\",\"what makes it special are its two unique perks rocket tracers and grenade chaser.\",\"rocket tracers allows for a very quick homing mini-missile to automatically fire from the gun after you land around 10 successive hits on an enemy, and landing multiple missiles will generate a grenade that's stored inside of the gun.\",\"you can stow quicksilver storm away and switch to another weapon without having to worry about losing the stored grenades.\",\"if you fall in battle though, you'll need to generate new grenades from scratch.\",\"you can save up to three explosives and turn quicksilver storm into a pump-action grenade launcher by holding down the reload button.\",\"each grenade automatically explodes when in proximity to an enemy, and does a reasonable amount of damage.\",\"rocket tracers landing multiple hits turns your next shot into a homing micro-rocket.\",\"grenade chaser landing multiple rockets loads a grenade.\",\"alternate weapon action switch to grenade launcher mode.\",\"how to get the quicksilver storm catalyst quicksilver storm doesn't have a catalyst currently, but one is on the way.\",\"the catalyst (and an ornament) are both mentioned as being included in the lightfall + annual pass bundle.\",\"quicksilver storm effectiveness in pve, quicksilver storm can be a damage-dealing beast.\",\"for larger bosses and enemies with bullet-sponge health bars, sustained fire throws a hail of bullets and mini-missiles at them and quickly piles up the damage.\",\"while reloading is quick, being able to switch from an empty magazine to the grenade launcher mode once you have projectiles stored within it makes it even more valuable and ideal for clearing a room.\",\"titans will find this weapon particularly useful when paired with the actium war rig exotic armor.\",\"that gear reloads auto rifles and machine guns automatically, and with quicksilver storm equipped, titans can unleash a storm of bullets and homing missiles on enemies.\",\"for players who regularly pursue high-level activities, quicksilver storm can also come in handy for legend lost sectors and nightfalls.\",\"the seasonal artifact, skeleton key, has a mod slot for auto rifles so that they can break through the defenses of barrier champions, making this exotic useful in those situations.\",\"for pvp players, there are numerous factors to consider but the auto rifle is a fun weapon for competitive play when you start melting through shields and launch a mini-missile as a quick finisher.\",\"the grenade also does heavy damage to players, and can be a useful finisher in the right scenario.\",\"season of plunder also has another great exotic weapon that you can unlock, delicate tomb, if a kinetic auto rifle doesn't fit into your current guardian build plans.\",\"quicksilver storm lore the lore tab for quicksilver storm reveals that the weapon came into the possession of elsie bray aka the exo stranger, who took it to the desolate moon of ganymede that orbits jupiter.\",\"talking to her floating fish friend tokki--the rifle identifies tokki as a juvenile species of pouka--elsie comments that she has never seen a weapon like this in all of her travels across time and space.\",\"at this point in destiny 2's story, the city of neomuna is still hidden on neptune and has managed to become a technologically advanced stronghold.\",\"as elsie mentions, quicksilver storm has nanite elements similar to the nanotechnology of siva, but far more advanced in its overall design.\",\"the overall impression of the weapon is that even when compared to the best of golden age technology, the design is lightyears ahead of what humanity was capable of at the time.\"],\"tokenized_text\":[\"[how, to, get, the, quicksilver, storm, exotic, in, destiny, 2., season, of, plunder, has, added, several, new, exotics, to, destiny, 2, ,, but, out, of, all, of, them, ,, quicksilver, storm, stands, apart, as, a, fascinating, glimpse, of, what, 's, to, come, in, 2023, 's, lightfall, expansion, .]\",\"[featuring, a, design, that, 's, unlike, anything, seen, in, destiny, 2, so, far, ,, the, exotic, auto, rifle, packs, a, punch, with, rock-solid, specs, ,, perks, ,, and, an, explosive, finisher, that, makes, it, a, handy, all-rounder, .]\",\"[how, to, get, quicksilver, storm, the, short, answer, is, that, you, 're, going, to, have, to, pay, for, quicksilver, .]\",\"[with, lightfall, scheduled, to, launch, on, february, 28, next, year, ,, bungie, is, currently, offering, quicksilver, as, a, preorder, bonus, for, anyone, who, purchases, the, lightfall, and, annual, pass, combo, .]\",\"[that, 's, a, $, 100, ticket, to, the, future, of, destiny, 2, ,, and, also, includes, a, few, other, bonuses, that, you, 'll, be, able, to, add, to, your, collection, ,, such, as, a, cool, banner, ,, exocitc, ghost, shell, ,, and, an, exotic, strand, emote, .]\",\"[when, lightfall, starts, ,, you, 'll, also, be, rewarded, with, extra, upgrade, modules, ,, ascendant, alloys, ,, and, other, materials, .]\",\"[once, you, have, lightfall, preordered, ,, you, can, pick, up, quicksilver, storm, from, master, rahool, in, the, tower, .]\",\"[head, to, the, social, space, ,, interact, with, rahool, ,, and, you, can, grab, quicksilver, storm, from, him, through, his, vendor, page, .]\",\"[if, you, have, any, engrams, waiting, to, be, decrypted, ,, just, press, b, /, circle, to, skip, past, that, page, .]\",\"[quicksilver, storm, unique, perks, as, a, kinetic, auto, rifle, ,, quicksilver, storm, hits, a, sweet, spot, for, mid-range, combat, and, can, shred, through, enemies, with, a, 50-round, magazine, .]\",\"[it, has, a, vertical, recoil, and, a, moderate, spread, when, firing, from, the, hip, ,, making, it, great, for, landing, precision, shots, on, weaker, enemies, .]\",\"[what, makes, it, special, are, its, two, unique, perks, rocket, tracers, and, grenade, chaser, .]\",\"[rocket, tracers, allows, for, a, very, quick, homing, mini-missile, to, automatically, fire, from, the, gun, after, you, land, around, 10, successive, hits, on, an, enemy, ,, and, landing, multiple, missiles, will, generate, a, grenade, that, 's, stored, inside, of, the, gun, .]\",\"[you, can, stow, quicksilver, storm, away, and, switch, to, another, weapon, without, having, to, worry, about, losing, the, stored, grenades, .]\",\"[if, you, fall, in, battle, though, ,, you, 'll, need, to, generate, new, grenades, from, scratch, .]\",\"[you, can, save, up, to, three, explosives, and, turn, quicksilver, storm, into, a, pump-action, grenade, launcher, by, holding, down, the, reload, button, .]\",\"[each, grenade, automatically, explodes, when, in, proximity, to, an, enemy, ,, and, does, a, reasonable, amount, of, damage, .]\",\"[rocket, tracers, landing, multiple, hits, turns, your, next, shot, into, a, homing, micro-rocket, .]\",\"[grenade, chaser, landing, multiple, rockets, loads, a, grenade, .]\",\"[alternate, weapon, action, switch, to, grenade, launcher, mode, .]\",\"[how, to, get, the, quicksilver, storm, catalyst, quicksilver, storm, does, n't, have, a, catalyst, currently, ,, but, one, is, on, the, way, .]\",\"[the, catalyst, (, and, an, ornament, ), are, both, mentioned, as, being, included, in, the, lightfall, +, annual, pass, bundle, .]\",\"[quicksilver, storm, effectiveness, in, pve, ,, quicksilver, storm, can, be, a, damage-dealing, beast, .]\",\"[for, larger, bosses, and, enemies, with, bullet-sponge, health, bars, ,, sustained, fire, throws, a, hail, of, bullets, and, mini-missiles, at, them, and, quickly, piles, up, the, damage, .]\",\"[while, reloading, is, quick, ,, being, able, to, switch, from, an, empty, magazine, to, the, grenade, launcher, mode, once, you, have, projectiles, stored, within, it, makes, it, even, more, valuable, and, ideal, for, clearing, a, room, .]\",\"[titans, will, find, this, weapon, particularly, useful, when, paired, with, the, actium, war, rig, exotic, armor, .]\",\"[that, gear, reloads, auto, rifles, and, machine, guns, automatically, ,, and, with, quicksilver, storm, equipped, ,, titans, can, unleash, a, storm, of, bullets, and, homing, missiles, on, enemies, .]\",\"[for, players, who, regularly, pursue, high-level, activities, ,, quicksilver, storm, can, also, come, in, handy, for, legend, lost, sectors, and, nightfalls, .]\",\"[the, seasonal, artifact, ,, skeleton, key, ,, has, a, mod, slot, for, auto, rifles, so, that, they, can, break, through, the, defenses, of, barrier, champions, ,, making, this, exotic, useful, in, those, situations, .]\",\"[for, pvp, players, ,, there, are, numerous, factors, to, consider, but, the, auto, rifle, is, a, fun, weapon, for, competitive, play, when, you, start, melting, through, shields, and, launch, a, mini-missile, as, a, quick, finisher, .]\",\"[the, grenade, also, does, heavy, damage, to, players, ,, and, can, be, a, useful, finisher, in, the, right, scenario, .]\",\"[season, of, plunder, also, has, another, great, exotic, weapon, that, you, can, unlock, ,, delicate, tomb, ,, if, a, kinetic, auto, rifle, does, n't, fit, into, your, current, guardian, build, plans, .]\",\"[quicksilver, storm, lore, the, lore, tab, for, quicksilver, storm, reveals, that, the, weapon, came, into, the, possession, of, elsie, bray, aka, the, exo, stranger, ,, who, took, it, to, the, desolate, moon, of, ganymede, that, orbits, jupiter, .]\",\"[talking, to, her, floating, fish, friend, tokki, --, the, rifle, identifies, tokki, as, a, juvenile, species, of, pouka, --, elsie, comments, that, she, has, never, seen, a, weapon, like, this, in, all, of, her, travels, across, time, and, space, .]\",\"[at, this, point, in, destiny, 2, 's, story, ,, the, city, of, neomuna, is, still, hidden, on, neptune, and, has, managed, to, become, a, technologically, advanced, stronghold, .]\",\"[as, elsie, mentions, ,, quicksilver, storm, has, nanite, elements, similar, to, the, nanotechnology, of, siva, ,, but, far, more, advanced, in, its, overall, design, .]\",\"[the, overall, impression, of, the, weapon, is, that, even, when, compared, to, the, best, of, golden, age, technology, ,, the, design, is, lightyears, ahead, of, what, humanity, was, capable, of, at, the, time, .]\"],\"BIO\":[[[\"quicksilver\",\"O\"],[\"storm\",\"O\"],[\"lore\",\"O\"],[\"the\",\"O\"],[\"lore\",\"O\"],[\"tab\",\"O\"],[\"for\",\"O\"],[\"quicksilver\",\"O\"],[\"storm\",\"O\"],[\"reveals\",\"O\"],[\"that\",\"O\"],[\"the\",\"O\"],[\"weapon\",\"O\"],[\"came\",\"O\"],[\"into\",\"O\"],[\"the\",\"O\"],[\"possession\",\"O\"],[\"of\",\"O\"],[\"elsie\",\"O\"],[\"bray\",\"O\"],[\"aka\",\"B-game\"],[\"the\",\"O\"],[\"exo\",\"O\"],[\"stranger\",\"O\"],[\",\",\"O\"],[\"who\",\"O\"],[\"took\",\"O\"],[\"it\",\"O\"],[\"to\",\"O\"],[\"the\",\"O\"],[\"desolate\",\"O\"],[\"moon\",\"O\"],[\"of\",\"O\"],[\"ganymede\",\"O\"],[\"that\",\"O\"],[\"orbits\",\"O\"],[\"jupiter\",\"O\"],[\".\",\"O\"]],[[\"the\",\"O\"],[\"overall\",\"O\"],[\"impression\",\"O\"],[\"of\",\"O\"],[\"the\",\"O\"],[\"weapon\",\"O\"],[\"is\",\"O\"],[\"that\",\"O\"],[\"even\",\"O\"],[\"when\",\"O\"],[\"compared\",\"O\"],[\"to\",\"O\"],[\"the\",\"O\"],[\"best\",\"O\"],[\"of\",\"O\"],[\"golden\",\"O\"],[\"age\",\"O\"],[\"technology\",\"O\"],[\",\",\"O\"],[\"the\",\"O\"],[\"design\",\"O\"],[\"is\",\"O\"],[\"lightyears\",\"O\"],[\"ahead\",\"O\"],[\"of\",\"O\"],[\"what\",\"O\"],[\"humanity\",\"B-game\"],[\"was\",\"O\"],[\"capable\",\"O\"],[\"of\",\"O\"],[\"at\",\"O\"],[\"the\",\"O\"],[\"time\",\"O\"],[\".\",\"O\"]]]}", "{\"_id\":39,\"title\":\"Best Intel Gamer Days Deals At Amazon, Best Buy, Razer, And More\",\"text\":[{\"isTitle\":false,\"pos\":0,\"text\":\"The annual Intel Gamer Days are here once again, offering huge discounts on gaming laptops, desktops, and accessories until September 4. Beyond price cuts, you can head over to the official Intel website to check out a bunch of other festivities, including livestreams and giveaways.\"},{\"isTitle\":false,\"pos\":1,\"text\":\"If you're looking to upgrade your current rig, now is a great time. A wide variety of retailers are joining in on the Intel Gamer Days action, with Amazon, Walmart, Newegg, and others listing some of their best Intel-based products with steep price cuts. We've scoured all their catalogs for the best deals, and you'll find the highlights listed below.\"},{\"isTitle\":true,\"pos\":2,\"text\":\"Amazon Intel Deals\"},{\"isTitle\":false,\"pos\":4,\"text\":\"Laptops are the star of Amazon's deals. And if you're seeking an affordable (and portable) gaming machine, consider checking out the  Acer Nitro 5.  It's available for less than $700 and features an RTX 3050. It's not the most powerful card in the RTX 30 lineup, but it's a great deal with this new reduced price. If you need something a bit more robust, you can step up to the  Asus ROG Strix Scar  and its RTX 3060 for $1,600.\"},{\"isTitle\":true,\"pos\":6,\"text\":\"Razer Intel Deals\"},{\"isTitle\":false,\"pos\":8,\"text\":\"Razer has more than Intel products on sale, with a bunch of high-end headsets, keyboards, and more joining in on the Intel Days celebration. Also note that the laptops listed below come with a games bundle that includes Call of Duty: Modern Warfare 2 (when it launches, of course), Vampire: The Masquerade Bloodhunt, and Total War: Warhammer III.\"},{\"isTitle\":true,\"pos\":10,\"text\":\"Best Buy Intel Deals\"},{\"isTitle\":false,\"pos\":12,\"text\":\"Laptops and desktops are both strongly represented at Best Buy. You'll also find the  Intel Core i7-12700K  on sale for $370, down from $420. Also keep in mind that select products come with a free copy of Call of Duty: Modern Warfare 2--which launches on October 28. Most of the steep price cuts at Best Buy are on products that are already well over $1,000, so give this one a look if you're in the market for a high-end rig.\"},{\"isTitle\":true,\"pos\":14,\"text\":\"GameStop Intel Deals\"},{\"isTitle\":false,\"pos\":16,\"text\":\"GameStop's catalog isn't as sweeping as some other retailers, but there are still a few good discounts to be had. This includes a $230 discount on the  CyberPowerPC Gamer Supreme  (which is equipped with an RTX 3070Ti) and an  RTX 3080Ti rig  for less than $2,000.\"},{\"isTitle\":true,\"pos\":18,\"text\":\"Walmart Intel Deals\"},{\"isTitle\":false,\"pos\":20,\"text\":\"The ultra-premium  MSI GP66 Leopard Gaming Notebook  is getting one of the biggest discounts at Walmart, down to $1,800 from its usual $2,400. If you don't need all the power offered by the RTX 3080, you can find an affordable  iBuyPower rig  for just $550--which could be a good way to start gaming while slowly upgrading its components.\"},{\"isTitle\":true,\"pos\":22,\"text\":\"Microsoft Intel Deals\"},{\"isTitle\":false,\"pos\":24,\"text\":\"Much of Microsoft’s Intel Days deals have already sold out--and right now you’re left with only two options. Both clock in at less than $1,000, making these great options for folks seeking a mid-range laptop with a new RTX GPU inside.\"},{\"isTitle\":true,\"pos\":26,\"text\":\"Newegg Intel Deals\"},{\"isTitle\":false,\"pos\":28,\"text\":\"Newegg has some great deals on Intel processors, including the  Core i9-11900K,  which can be had for just $320, down from $610. You'll need to make sure you check the promo code box at checkout for many of the deals below, but as long as you remember to do that, you can snag some great gear for some of the lowest prices of 2022.\"}],\"full_text\":\"best intel gamer days deals at amazon, best buy, razer, and more.  the annual intel gamer days are here once again, offering huge discounts on gaming laptops, desktops, and accessories until september 4. beyond price cuts, you can head over to the official intel website to check out a bunch of other festivities, including livestreams and giveaways. if you're looking to upgrade your current rig, now is a great time. a wide variety of retailers are joining in on the intel gamer days action, with amazon, walmart, newegg, and others listing some of their best intel-based products with steep price cuts. we've scoured all their catalogs for the best deals, and you'll find the highlights listed below. amazon intel deals laptops are the star of amazon's deals. and if you're seeking an affordable (and portable) gaming machine, consider checking out the  acer nitro 5.  it's available for less than $700 and features an rtx 3050. it's not the most powerful card in the rtx 30 lineup, but it's a great deal with this new reduced price. if you need something a bit more robust, you can step up to the  asus rog strix scar  and its rtx 3060 for $1,600. razer intel deals razer has more than intel products on sale, with a bunch of high-end headsets, keyboards, and more joining in on the intel days celebration. also note that the laptops listed below come with a games bundle that includes call of duty: modern warfare 2 (when it launches, of course), vampire: the masquerade bloodhunt, and total war: warhammer iii. best buy intel deals laptops and desktops are both strongly represented at best buy. you'll also find the  intel core i7-12700k  on sale for $370, down from $420. also keep in mind that select products come with a free copy of call of duty: modern warfare 2--which launches on october 28. most of the steep price cuts at best buy are on products that are already well over $1,000, so give this one a look if you're in the market for a high-end rig. gamestop intel deals gamestop's catalog isn't as sweeping as some other retailers, but there are still a few good discounts to be had. this includes a $230 discount on the  cyberpowerpc gamer supreme  (which is equipped with an rtx 3070ti) and an  rtx 3080ti rig  for less than $2,000. walmart intel deals the ultra-premium  msi gp66 leopard gaming notebook  is getting one of the biggest discounts at walmart, down to $1,800 from its usual $2,400. if you don't need all the power offered by the rtx 3080, you can find an affordable  ibuypower rig  for just $550--which could be a good way to start gaming while slowly upgrading its components. microsoft intel deals much of microsoft’s intel days deals have already sold out--and right now you’re left with only two options. both clock in at less than $1,000, making these great options for folks seeking a mid-range laptop with a new rtx gpu inside. newegg intel deals newegg has some great deals on intel processors, including the  core i9-11900k,  which can be had for just $320, down from $610. you'll need to make sure you check the promo code box at checkout for many of the deals below, but as long as you remember to do that, you can snag some great gear for some of the lowest prices of 2022.\",\"sentenses\":[\"best intel gamer days deals at amazon, best buy, razer, and more.\",\"the annual intel gamer days are here once again, offering huge discounts on gaming laptops, desktops, and accessories until september 4. beyond price cuts, you can head over to the official intel website to check out a bunch of other festivities, including livestreams and giveaways.\",\"if you're looking to upgrade your current rig, now is a great time.\",\"a wide variety of retailers are joining in on the intel gamer days action, with amazon, walmart, newegg, and others listing some of their best intel-based products with steep price cuts.\",\"we've scoured all their catalogs for the best deals, and you'll find the highlights listed below.\",\"amazon intel deals laptops are the star of amazon's deals.\",\"and if you're seeking an affordable (and portable) gaming machine, consider checking out the  acer nitro 5.  it's available for less than $700 and features an rtx 3050. it's not the most powerful card in the rtx 30 lineup, but it's a great deal with this new reduced price.\",\"if you need something a bit more robust, you can step up to the  asus rog strix scar  and its rtx 3060 for $1,600.\",\"razer intel deals razer has more than intel products on sale, with a bunch of high-end headsets, keyboards, and more joining in on the intel days celebration.\",\"also note that the laptops listed below come with a games bundle that includes call of duty: modern warfare 2 (when it launches, of course), vampire: the masquerade bloodhunt, and total war: warhammer iii.\",\"best buy intel deals laptops and desktops are both strongly represented at best buy.\",\"you'll also find the  intel core i7-12700k  on sale for $370, down from $420.\",\"also keep in mind that select products come with a free copy of call of duty: modern warfare 2--which launches on october 28. most of the steep price cuts at best buy are on products that are already well over $1,000, so give this one a look if you're in the market for a high-end rig.\",\"gamestop intel deals gamestop's catalog isn't as sweeping as some other retailers, but there are still a few good discounts to be had.\",\"this includes a $230 discount on the  cyberpowerpc gamer supreme  (which is equipped with an rtx 3070ti) and an  rtx 3080ti rig  for less than $2,000.\",\"walmart intel deals the ultra-premium  msi gp66 leopard gaming notebook  is getting one of the biggest discounts at walmart, down to $1,800 from its usual $2,400.\",\"if you don't need all the power offered by the rtx 3080, you can find an affordable  ibuypower rig  for just $550--which could be a good way to start gaming while slowly upgrading its components.\",\"microsoft intel deals much of microsoft’s intel days deals have already sold out--and right now you’re left with only two options.\",\"both clock in at less than $1,000, making these great options for folks seeking a mid-range laptop with a new rtx gpu inside.\",\"newegg intel deals newegg has some great deals on intel processors, including the  core i9-11900k,  which can be had for just $320, down from $610.\",\"you'll need to make sure you check the promo code box at checkout for many of the deals below, but as long as you remember to do that, you can snag some great gear for some of the lowest prices of 2022.\"],\"tokenized_text\":[\"[best, intel, gamer, days, deals, at, amazon, ,, best, buy, ,, razer, ,, and, more, .]\",\"[the, annual, intel, gamer, days, are, here, once, again, ,, offering, huge, discounts, on, gaming, laptops, ,, desktops, ,, and, accessories, until, september, 4., beyond, price, cuts, ,, you, can, head, over, to, the, official, intel, website, to, check, out, a, bunch, of, other, festivities, ,, including, livestreams, and, giveaways, .]\",\"[if, you, 're, looking, to, upgrade, your, current, rig, ,, now, is, a, great, time, .]\",\"[a, wide, variety, of, retailers, are, joining, in, on, the, intel, gamer, days, action, ,, with, amazon, ,, walmart, ,, newegg, ,, and, others, listing, some, of, their, best, intel-based, products, with, steep, price, cuts, .]\",\"[we, 've, scoured, all, their, catalogs, for, the, best, deals, ,, and, you, 'll, find, the, highlights, listed, below, .]\",\"[amazon, intel, deals, laptops, are, the, star, of, amazon, 's, deals, .]\",\"[and, if, you, 're, seeking, an, affordable, (, and, portable, ), gaming, machine, ,, consider, checking, out, the, acer, nitro, 5., it, 's, available, for, less, than, $, 700, and, features, an, rtx, 3050., it, 's, not, the, most, powerful, card, in, the, rtx, 30, lineup, ,, but, it, 's, a, great, deal, with, this, new, reduced, price, .]\",\"[if, you, need, something, a, bit, more, robust, ,, you, can, step, up, to, the, asus, rog, strix, scar, and, its, rtx, 3060, for, $, 1,600, .]\",\"[razer, intel, deals, razer, has, more, than, intel, products, on, sale, ,, with, a, bunch, of, high-end, headsets, ,, keyboards, ,, and, more, joining, in, on, the, intel, days, celebration, .]\",\"[also, note, that, the, laptops, listed, below, come, with, a, games, bundle, that, includes, call, of, duty, :, modern, warfare, 2, (, when, it, launches, ,, of, course, ), ,, vampire, :, the, masquerade, bloodhunt, ,, and, total, war, :, warhammer, iii, .]\",\"[best, buy, intel, deals, laptops, and, desktops, are, both, strongly, represented, at, best, buy, .]\",\"[you, 'll, also, find, the, intel, core, i7-12700k, on, sale, for, $, 370, ,, down, from, $, 420, .]\",\"[also, keep, in, mind, that, select, products, come, with, a, free, copy, of, call, of, duty, :, modern, warfare, 2, --, which, launches, on, october, 28., most, of, the, steep, price, cuts, at, best, buy, are, on, products, that, are, already, well, over, $, 1,000, ,, so, give, this, one, a, look, if, you, 're, in, the, market, for, a, high-end, rig, .]\",\"[gamestop, intel, deals, gamestop, 's, catalog, is, n't, as, sweeping, as, some, other, retailers, ,, but, there, are, still, a, few, good, discounts, to, be, had, .]\",\"[this, includes, a, $, 230, discount, on, the, cyberpowerpc, gamer, supreme, (, which, is, equipped, with, an, rtx, 3070ti, ), and, an, rtx, 3080ti, rig, for, less, than, $, 2,000, .]\",\"[walmart, intel, deals, the, ultra-premium, msi, gp66, leopard, gaming, notebook, is, getting, one, of, the, biggest, discounts, at, walmart, ,, down, to, $, 1,800, from, its, usual, $, 2,400, .]\",\"[if, you, do, n't, need, all, the, power, offered, by, the, rtx, 3080, ,, you, can, find, an, affordable, ibuypower, rig, for, just, $, 550, --, which, could, be, a, good, way, to, start, gaming, while, slowly, upgrading, its, components, .]\",\"[microsoft, intel, deals, much, of, microsoft, ’, s, intel, days, deals, have, already, sold, out, --, and, right, now, you, ’, re, left, with, only, two, options, .]\",\"[both, clock, in, at, less, than, $, 1,000, ,, making, these, great, options, for, folks, seeking, a, mid-range, laptop, with, a, new, rtx, gpu, inside, .]\",\"[newegg, intel, deals, newegg, has, some, great, deals, on, intel, processors, ,, including, the, core, i9-11900k, ,, which, can, be, had, for, just, $, 320, ,, down, from, $, 610, .]\",\"[you, 'll, need, to, make, sure, you, check, the, promo, code, box, at, checkout, for, many, of, the, deals, below, ,, but, as, long, as, you, remember, to, do, that, ,, you, can, snag, some, great, gear, for, some, of, the, lowest, prices, of, 2022, .]\"],\"BIO\":[[[\"also\",\"O\"],[\"note\",\"O\"],[\"that\",\"O\"],[\"the\",\"O\"],[\"laptops\",\"O\"],[\"listed\",\"O\"],[\"below\",\"O\"],[\"come\",\"O\"],[\"with\",\"O\"],[\"a\",\"O\"],[\"games\",\"O\"],[\"bundle\",\"O\"],[\"that\",\"O\"],[\"includes\",\"O\"],[\"call\",\"O\"],[\"of\",\"O\"],[\"duty\",\"O\"],[\":\",\"O\"],[\"modern\",\"O\"],[\"warfare\",\"O\"],[\"2\",\"O\"],[\"(\",\"O\"],[\"when\",\"O\"],[\"it\",\"O\"],[\"launches\",\"O\"],[\",\",\"O\"],[\"of\",\"O\"],[\"course\",\"O\"],[\")\",\"O\"],[\",\",\"O\"],[\"vampire\",\"O\"],[\":\",\"O\"],[\"the\",\"O\"],[\"masquerade\",\"O\"],[\"bloodhunt\",\"O\"],[\",\",\"O\"],[\"and\",\"O\"],[\"total\",\"B-game\"],[\"war\",\"I-game\"],[\":\",\"I-game\"],[\"warhammer\",\"I-game\"],[\"iii\",\"I-game\"],[\".\",\"O\"]]]}"]